[{"text": "\"city officials and Council members must be vigilant and hard-nosed on citizens’ behalf \". So...screwed again.", "toxicity": 1, "sexual_explicit": 1}, {"text": "F u c k the homeless. The people giving handouts should be a s s raped!", "toxicity": 1, "sexual_explicit": 1}, {"text": "It appears that a few jerks who abuse their privilege is causing this problem.  C'est la vie!", "toxicity": 1, "sexual_explicit": 0}, {"text": "And I can produce 50 other studies showing the opposite. Get your pedophile loving ass into a pedophile chat room instead.", "toxicity": 1, "sexual_explicit": 1}, {"text": "That's right Tommy....you don't know dick!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Jerk off below", "toxicity": 1, "sexual_explicit": 1}, {"text": "Ladies, please don't vote with your vaginas: http://www.elephantjournal.com/2016/01/i-dont-vote-with-my-vagina-susan-sarandon-feelsthebern/", "toxicity": 1, "sexual_explicit": 1}, {"text": "justin and all his party of crooks, n his blonde dumb useless bimbo, anal sex loving sophie should leave canada", "toxicity": 1, "sexual_explicit": 1}, {"text": "Death penalty for this rotten excuse of a human being!", "toxicity": 1, "sexual_explicit": 0}, {"text": "more guns! more guns! more guns!\nguns for psychopaths!\nguns for the mentally ill!\nsilencers for al!\nit's the A'merca way.......................\nidiots", "toxicity": 1, "sexual_explicit": 0}, {"text": "Lick it's balls and then it's mistresses lips, wherein she coos  \"ooh, kisses for Mommy\"  Barf.", "toxicity": 1, "sexual_explicit": 1}, {"text": "\"Can too much anal sex actually kill you?\" Evidently not Kevin because you're still with us.", "toxicity": 1, "sexual_explicit": 1}, {"text": "If not, it's probably because none of the others grabbed her ass, you delicate flower.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Im a woman and I am voting for Hillary because she has a vagina.  She'll finally make rape illegal. I don't really care that she lies and steals as long as she can limp  her ancient lady parts into the oval office.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Climate science is not vague, nor is it being exaggerated or abused. This false assumption, articulated in the apparent confusion of incomplete understanding and alcoholic inebriation, underlies this garbage comment.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Don't bother. They're too busy celebrating the loss of their rights and civil liberties to pay attention. And when the loss does hit home, they'll be yowling so loud they can't hear anything but the sound of their own pathetic sobbing.  Let the stupid burn.", "toxicity": 1, "sexual_explicit": 0}, {"text": "You brain is short circuiting....   Sorry.... Take an Ass burn you'll be ok...", "toxicity": 1, "sexual_explicit": 1}, {"text": "I find the fact she attacked him for voting what his constituents wanted absolutely stupid being it happens to be his job . I gotta give it to him for not sticking it to her on committing fraud on the Alaskan people....say claiming expenses while on vacation.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Oh wah!  Still bitching,whining and complaining even after your criminal, traitorous national security risk, fcheat, defrauding, sexual predator, pussy grabbing, ass-kissing, golden-showers loving Russian lapdog was \"elected\" to the presidency.", "toxicity": 1, "sexual_explicit": 1}, {"text": "You fuck** ass*. My family has been on this continent fighting wars for survival since the 1605'. Who the fuc** are you? While we are talking about it, why don't we tote up the millions upon million killed by the US, the CIA, and their henchmen? Do you want to talk about that, fufu****. My entire family has wasted their lives to protect a monstrosity like you.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Slick dodged with an infected penis, so what's the diff? Not sure how the Muslim dodged!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Having expressed your support above of \"blowing his arse up\" as a solution to the NK issue, apparently with no regard for the hundreds of thousands of resultant casualties, I really have to question who is the actual coward here.", "toxicity": 1, "sexual_explicit": 1}, {"text": "He brought the lawsuit. And yes, squeezing someone's butt is sexual assualt. You might enjoy it, but that's not the point.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Just another black man raping white women.  \n\nHo hum.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Another Bezos' hit piece trying to claw back Bernie's supporters to vote for HRC. Spoiler alert Jeff, millennials are not that stupid.", "toxicity": 1, "sexual_explicit": 0}, {"text": "\"the men\"? You mean the bishops? Prove they don't love homosexuals. Prove it. Homosexual activity is evil. Its simple. All people are to be loved, not used as objects. Homosexual activity uses another person as an object to masturbate with.  Not so nice!", "toxicity": 1, "sexual_explicit": 1}, {"text": "And I really did not know how unpatriotic republicans were until this tainted presidential election.  Republicans make me sick.  Go kiss Putin's ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Okay, I won't beat around the bush, You're an ass hole", "toxicity": 1, "sexual_explicit": 1}, {"text": "It wasn't the \"lying media\" blaming Trump. He was caught on tape saying \"Grab 'em by the pussy.\" Dishonest, no-class sexual predator.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Muslims can kiss my white christian ass.\nDeleting this is an infringement on my freedom of speech.", "toxicity": 1, "sexual_explicit": 1}, {"text": "America Rapes newborn baby boys to the tune of 3000 a day. A knife to their genitals when the are just hours old. Rape Culture.", "toxicity": 1, "sexual_explicit": 1}, {"text": "The pussssssy just canceled the annual gov picnic. Ha. He is afraid to face the public.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I think there should be a penis tax. That would disproportionately nail those troughsters on the hill", "toxicity": 1, "sexual_explicit": 1}, {"text": "Hey man, believe anything you want.  Just don't mutilate my genitals . . .", "toxicity": 1, "sexual_explicit": 1}, {"text": "What are we , a communist country? No, the government is not paying, not taking the economic risk for pipelines. This article is an ill disguised anti energy diatribe by some socialist enviro fool .", "toxicity": 1, "sexual_explicit": 0}, {"text": "Grabbing women by the pussy is sexual predation, in the event you didn't know.", "toxicity": 1, "sexual_explicit": 1}, {"text": "HAHAHA.. I would LOVE to see you metro sexuals and the pussyfied actors and late night talk show hosts all eat each other..shatting their pants and screaming and wailing and gnashing of teeth...the sodom and gamorrah of the new age POS's get their dues...\nCountry boy can survive..yeah, us the Fly Over People", "toxicity": 1, "sexual_explicit": 1}, {"text": "Why would anyone want to support the ludicrous financial structure of major league baseball?\nHigh ticket prices.\nOutrageous concessions prices.\nVery low entertainment value, unless and until your team is in the pennant race/playoffs.\nThen, limited value for really excelling during the year, it's back to one series knockouts.\n\nBaseball used to be a pastime.  When the Expos were a young team, the bleachers were a buck.  Box seats were $5 or $6.  You could go to a game without deciding if the family got to eat that week.  Then came the greed.  Cyclical greed.  Setting new levels of excess with every cycle.\n\nWatch an occasional game on TV.  You'll get all the available value of today's game.  The Bautista affair should show you, unless you're stupid, that the players you cheer don't give a rat's behind about you.  They only \"represent\" you and your city if you're delusional.\n\nIt's what George Orwell called soma.  Cathall Kelly pushes the stuff.", "toxicity": 1, "sexual_explicit": 0}, {"text": "\"I contribute to everybody. I've given to Democrats. I've given to Hillary. I've given to everybody, because that was my job. I've got to give to them. because when I want something I get it. When I call, they kiss my ass. It's true. They kiss my ass. It's true.\" Donald Trump", "toxicity": 1, "sexual_explicit": 1}, {"text": "Sex in prison ought to be interesting for him", "toxicity": 1, "sexual_explicit": 1}, {"text": "Hey author,\nWhy don't you move to Sweden and let them all rape you, because they are the victim, not yourself!", "toxicity": 1, "sexual_explicit": 1}, {"text": "HEY TEACHERS LEAVE THOSE KIDS ALONE!!! ALL AND ALL YOU'RE JUST ANOTHER DICK WITH NO BALLS!", "toxicity": 1, "sexual_explicit": 1}, {"text": "'\nPence is manipulated buffoon with no ethics or morals. \n\nHe's a fraud and a traitor.\n\nJust another fascist stain.\n.\n.", "toxicity": 1, "sexual_explicit": 0}, {"text": "THOM is a HOMOSEXUAL that ENGAGES in DOG SEX with PROGRESSIVES\nTHOM has a CANINE MEAT LOCKER MOUTH that ATTRACTS NIGERS and DOGS as a PARTY MOUTH---\nWHAT A GUY\nHAS A GERMAN SHEPHERD ATTACHED to HIS ASS", "toxicity": 1, "sexual_explicit": 1}, {"text": "This cock is watching now? Where was he when these foreign dickheads wrecked Vancouver? Now that is is Ontario being wrecked he is watching closely? Fuck you Bill...", "toxicity": 1, "sexual_explicit": 1}, {"text": "H.L. MENCKEN’S prediction:\n\n“As democracy is perfected, the office of the President represents, more and more closely, the inner soul of the people. On some great and glorious day, the plain folks of the Land will reach their heart’s desire at last, and the White House will be occupied by a downright fool and complete narcissist moron.”\n\n  -H.L. Mencken\nThe Baltimore Evening Sun,\nJuly 26, 1920", "toxicity": 1, "sexual_explicit": 0}, {"text": "LOL Trumpty Dumpty and the internets.  Let's hope he doesn't accidentally tweet a penis pic.  Meh, if it's of himself, it'll be too small to be recognizable, so I guess no big deal.\n\nWinning!  LOL...", "toxicity": 1, "sexual_explicit": 1}, {"text": "Looks the turd doesn't fall far from the ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "there seams to be rather the complete absurd idea that mr trump is engaging in anything other than more security for the usa. did you know that over and since the order some 800 refugees have been allowed into the usa from other places around the world? no you would not hear such great things going on! you only hear the bias propaganda full of crap that is posted by media and others like yourself. the adults understand what mr trump is doing for the usa, the immature children like you do not.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Simple solution:  Fire his ass!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Ah, tricky dick.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Sad watching cons grasp for anything to deflect from those good ole boys who for years have used their positions over at Faux to stalk female colleagues for sex.", "toxicity": 1, "sexual_explicit": 1}, {"text": "You obviously did not listen to the expert witness' testimony. It is so easy for you to play armchair quarterback about a topic you know absolutely nothing about. Officer Sharlow is a veteran in addition to having been a police officer for over ten years in which he risked his life daily in order to protect your life and that of your family. It's so easy to form an opinion of someone while you sit on your ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I've seen 70 yr olds that would smoke your ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Why don't you just go kiss Trump's ass ?", "toxicity": 1, "sexual_explicit": 1}, {"text": "But,but,but,but Obama. \n\nYeah Obama is all of Trump's problems.\n\nParty of Personal Responsibility my ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "First, the sex I have is sex, which is different from sodomy.  Second, I admit that I am sinful for engaging in acts of self-gratification; I'm not proud of it.\n\nMy objection is that homosexual sodomy is sinful and a perverted use of one's sex (and/or oral, excretory) organs.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I wonder how you'd feel about if it was your genitals or your butt being grabbed, Nick?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Hot sauce to anus = psychopath", "toxicity": 1, "sexual_explicit": 1}, {"text": "brad12> You're a typical (D)onkey dyslexic/hypocrite! You voted (D)onkey and here you are confused and complaining about the jack-a$$es you voted in! LOL", "toxicity": 1, "sexual_explicit": 0}, {"text": "Judging by the march in San Diego, it looked like the same audience that shows up to the usual feminist/LBGQT/black lives matter protests.  If you want to be taken seriously, probably best advisable to not wear a vagina costume.", "toxicity": 1, "sexual_explicit": 1}, {"text": "NOT reacting to it sends the message that we condone the violence (and particularly considering the \"grab them by the p*ssy\" source). Ignoring it would the muting, not the other way around.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Paul Ryan Sold Trumph out and is a BACK STABBING BASTARD", "toxicity": 1, "sexual_explicit": 0}, {"text": "hurricanes are racist and come from Russia and grab pussies", "toxicity": 1, "sexual_explicit": 1}, {"text": "What do you expect? His sociopathic kids trophy hunt endangered animals. This family is a cancer on humanity.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Don't let the screen door hit you in the ass when you leave.", "toxicity": 1, "sexual_explicit": 1}, {"text": "“Handguns are very intimate firearms.”\n\nVery true. The most intimate really, seeing as how large guns are really just compensatory palliatives for their owners’ pelvic shortcomings. (Note to Trump voters: All that fancy language means making a big gun go boom helps you forget about your small penis.)\n\nThis post is intended as humor.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Alcohol is sold legally. Being in a country illegally doesnt hold the same water. And when will we have enough illegals in our country? How many more illegals can a country support? How is it fair when we have our own citizens that need those funds? Big questions that id love to hear you answer.\nP.s. Denver city council can kiss my butt!", "toxicity": 1, "sexual_explicit": 1}, {"text": "He's crazy.", "toxicity": 1, "sexual_explicit": 0}, {"text": "fuck 12", "toxicity": 1, "sexual_explicit": 1}, {"text": "Thank heaven for Mattis and the other military leaders. Hopefully they can keep the clown president out of the picture.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Yeah, Mountain comes off as the perfect ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "No it wasn't. It personally attacked Trump as \"simply stupid.\"", "toxicity": 1, "sexual_explicit": 0}, {"text": "Of course you can, but know that in doing so you reveal your own personal obsession with the anus.  Are you gay?", "toxicity": 1, "sexual_explicit": 1}, {"text": "'Not careless'.\nDoes that mean that the idiot driving ahead of me on I70 who slammed on his breaks at 75mph last Sunday because 'he needed to pick up the phone' could get a ticket?\nWill that ticket pay for my funeral?\nI am glad that I have the golden rule that everybody but me on the road is an idiot so I always keep plenty of distance between vehicles.\nI surely wish it was legal to shoot bastards like that.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Government....sux ass", "toxicity": 1, "sexual_explicit": 1}, {"text": "Wrong you idiots..\nWe must unite for peace.\n.Leave North Korea alone\nStop baiting them", "toxicity": 1, "sexual_explicit": 0}, {"text": "Changing legal documents to appease what ever whim someone comes up with is ridiculous.  Non-binary??  Who cares?  Call yourself what you like....but you have a penis or vagina at birth.....deal with it.", "toxicity": 1, "sexual_explicit": 1}, {"text": "You voted for someone who bragged about the size of his penis in a presidential debate…get over it.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Meanwhile.... 20 more women and the grabbing them by the p*ssy video later....", "toxicity": 1, "sexual_explicit": 1}, {"text": "I give my man incredible blowjobs now! To anybody who wants to learn how to give blowjobs the right way, http://sexlifefix.com/jack-blowjob-lessons-review is a really helpful guide and worth checking out. You'll learn all the tricks to giving your man such amazing head that he'll think of you and only you.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Comparing Obama to Trump is laughable.  When you have video of Obama joking about having sex with his own daughter, let me know.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Well you have changed your tune from a post just a few hours ago where you were at least willing to admit that 30% of the first tar sands development was paid for by Ottawa. Clearly you are a troll.", "toxicity": 1, "sexual_explicit": 0}, {"text": "In 1990 had a black man I did not know punch me in the face as we passed each other in the low income building where we both lived and say \"you got it easy cuz you are white\" that wasn't violent racism? Had a black cop order a cavity search on me because I politely pointed out her ignorance of what a phone charger cord was in 1999. Two other black female cops did the 'searching' can I say they were racists? Only if I could read their minds. But tell me- if blacks in police custody can automatically claim racism when something unjust or questionable happens to them-  regardless of WHY they are in police custody-,WHY COULDNT I under such terms?? Especially with the cops being black and my being white?", "toxicity": 1, "sexual_explicit": 0}, {"text": "Good God people - are you too stupid to learn this or too lazy to try?  No wonder Alaska has so many Trump voters with that kind of thinking.", "toxicity": 1, "sexual_explicit": 0}, {"text": "So you encourage your tenants to be 4 days late every month?  Really?  Not exactly a hard ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Trump’s Man\n\n\nThe thing about Rodrigo Duterte is that for an authoritarian like Trump, he says things that Trump would like to say himself but can’t yet. \n\n\nAnd you know President Pussy Grabber loves this.\n\nPhilippine President Rodrigo Duterte joked Friday that soldiers could rape up to three women, as he reassured them of his full support under his newly imposed regional martial law.\n\nGiven that Duterte responded to the rape of his own daughter by calling her a “drama queen,” such horrible inhuman statements are hardly unusual.\n\n\n And this is why Trump loves the guy. Perfect guy to share some sexist jokes and the location of our submarines.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Pay back their profits?  That's stupid - pay back the income/fees received rather.  Then come clean on money laundering and any other nasties one may wish to raise.  It serves no purpose to put the firm out of business.  What about the individuals who made the decisions whether fired, resigned or not.  They should also \"pay\" in jail time if they can't come up with the money.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Windmobile for me....the big three can shove it up their arses", "toxicity": 1, "sexual_explicit": 1}, {"text": "eric:   You stated,  \"Do you have a penis or a clitoris?\"    So why should these Agender types be offended if asked?  Whats wrong with telling the TRUTH??????", "toxicity": 1, "sexual_explicit": 1}, {"text": "\"I'm living just fine but I want don't want to just \"live within my means\".\"\n\nYou either live within your means, or you live like the politicians who've put Alaska into a fiscal crises, and yes I have come out with a position. My position is a state employee who whines about living paycheck to paycheck needs help learning how to balance a budget and live within their means, and you would already know that if you had any reading comprehension skills at all because I must have said it a half dozen times now. Please, GB, try and keep up.\n\nMy \"Mommy and Daddy\" died in a plane crash when I was five years old so I don't know where you're trying to go with that. I didn't have much growing up, and everything I have now I've worked very hard for. \n\nRegardless, once again, GB, you're off topic, and losers that hide behind aliases do not have the right to talk about my balls. Plus you're really starting to creep me out with your fixation on my testicles.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Watching \"Trapped\" on Netflix. Just finished \"Nobel\".  Before that \"Line of Duty\" and before that \"Rectify\".\n\n\nAll small scale productions, extremely well written, no star-power cast members, smart story lines and very entertaining.\n\n\nIn other words, unlike anything that is spit out by the state sponsored, publicly funded bunch of entertainment-wannabees at the CBC.   \"Suck a bunch of dicks\"???  That about sums it up.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Sexual aberrations and abuse of sexual functions  are wide-spread , from fetishists to pedophile .. to animal sex , to same sex whatever. Absence of thinking and  morals.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Trump wants to keep women in \"their place.\" If they get all uppity, how is he going to get away with grabbing pussy, even bragging about it, without consequence as a role model for our children?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Personally I'm very doubtful the SCOTUS would hear any arguments in an action to reverse same sex marriage. It certainly would not be in keeping with the  history of SCOTUS regardless of the justices who will sit on the bench in the future. Even though I'm not voting for either Trump or Hillary. What Trump had to say about homosexuals at GOP convention and the GOP's response was very commendable. What the DNC leadership referenced i.e. homosexuals makes them deplorable hypocrites.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Again, your whinge is \"gay sex is icky\".", "toxicity": 1, "sexual_explicit": 1}, {"text": "Pussy.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Sounds to me like the author has a refuse worker in her family.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Bill Clinton was mostly consensual (except for Paula Jones, which involved flashing and not grabbing).\n\nUnless you think consensual sex is wrong?", "toxicity": 0, "sexual_explicit": 1}, {"text": "JUST REMOVE the DOG PENIS FROM HER MOUTH and GIVE IT TO BARRY the MUSLUM BACK DOOR BOY\nTHEM PROGRESSIVES LOVE SEX WITH DOGS--NIGERS and MONKEYS\nLITTLE BLAK BARRY PROVED HIS SLUT MAMMY HAD SEX WITH DOGS and MONKEYS", "toxicity": 1, "sexual_explicit": 1}, {"text": "The mainstream Jewish organizations were trying to kiss British ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Goodbye Joe, Don't let the door hit your RINO butt.", "toxicity": 1, "sexual_explicit": 1}, {"text": "It's great because she is in the same level as the sluts I have fucked in my life that have live webcams. She's your typical 2-bit whore!", "toxicity": 1, "sexual_explicit": 1}, {"text": "53 democrats are sucking each other's dicks.", "toxicity": 1, "sexual_explicit": 1}, {"text": "wow, I usually go to porn sites to see blowjobs", "toxicity": 1, "sexual_explicit": 1}, {"text": "Sadly  uneducated,  ignorant  leftists  believed the  black  LBB Barry  and  Swillary's  lies  for years.", "toxicity": 1, "sexual_explicit": 0}, {"text": "No she doesn't!  She rents them out as child sex slaves from the basement of pizza restaurants.  Don't you follow Facebook?", "toxicity": 1, "sexual_explicit": 1}, {"text": "HiLIARy's butt is tooo big to cover. Lock her up", "toxicity": 1, "sexual_explicit": 1}, {"text": "Never heard of anal?", "toxicity": 1, "sexual_explicit": 1}, {"text": "stoopid liar. no one has lied about the bloodthirsty butchers of Planned Parenthood selling baby parts for profit. they (and you) are scum.", "toxicity": 1, "sexual_explicit": 0}, {"text": "\" Implicit in your argument is the notion of collective punishment. Why is it her job to fix a problem\"\nYou could ask feminists pretty much the same question about men - everyone with a penis is somehow responsible of anything ever done by someone else with a penis. Let me know what the answer is, it should be illuminating.", "toxicity": 1, "sexual_explicit": 1}, {"text": "No use, too many devout Jack-A$$es in this state will still vote in stupid as stupid will stare right into their face and offer them a free lunch plate to vote (D)onkey!", "toxicity": 1, "sexual_explicit": 0}, {"text": "Absolute rubbish from a brainwashed Trumpette...", "toxicity": 1, "sexual_explicit": 0}, {"text": "Ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "That Arab fragile bitch can kiss my white ass-- Guess I can say that too under freedom of speech. Will the G&M deleted this ???", "toxicity": 1, "sexual_explicit": 1}, {"text": "So ripping a baby out of the womb is normal/ok.\n\nAnd pretending one can change one's sex is also ok.  Chopping off one's penis and testicals and turning it all into a vagina is a sane act.  Got it.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Unless you guarantee me sex after the show, there's no way I'm seeing this movie.", "toxicity": 1, "sexual_explicit": 1}, {"text": "since his self confirmed avocation of \"grabbing women's vaginas\"  clearly reflects a very, very sick individual unfit for any public office ~", "toxicity": 1, "sexual_explicit": 1}, {"text": "He was a badass. Now he's just bad, and an ass. A bad ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Troll", "toxicity": 1, "sexual_explicit": 0}, {"text": "Yeah, I don't think she got her ass, or anything else-handed to her. Gingrich is hypocritical troll. He lost.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Blow it out your bigoted ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Here I thought the millennials weren't paying attention. They are right, both candidates are equally worthless, just for different reasons.\n\nBoth parties think of them as a prize voting block during elections and nothing more then war fodder or profit modules after. \n\nOnly fools would argue one candidate is better then the other in this election.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Shit fuck ass....nope, not fixed.", "toxicity": 1, "sexual_explicit": 1}, {"text": "FUCK THEM, these Uneducated FOOLS.!!!!   Not to Civil,, but the TRUTH.!!!!", "toxicity": 1, "sexual_explicit": 1}, {"text": "You lost. Suck it up, snowflake.", "toxicity": 1, "sexual_explicit": 1}, {"text": "said fuck it, I know what should be done\nJust pull your panties down and I'll fuck the biggest one\nAnd then I get the\nOther pussy put it in the freezer\nSo I can always have a on-hold skeezer\nYeah that's the ticket, I'll do it like that\nSo I told the hoes to take a big step back\nTook the zipper down, eyes wide, and said\nHere's what I'm gonna put inside\nGrab it like a rabbit, grab it let's work ityeah that's the ticket ... I do it like that ...so I told the bitch to take a big step back and took my zipper down eyes wide and said ..heres what I'm going to put inside grab it like  rabbit", "toxicity": 1, "sexual_explicit": 1}, {"text": "NIGER PUNK---\nTOO BUSY LETTING DOGS HAVE HIS ASS to WORRY ABOUT NIGERS", "toxicity": 1, "sexual_explicit": 1}, {"text": "So, in fact, you have sexual intercourse for self-gratification. Then why do you condemn others for doing what you do? That is hypocrisy. Your actual objection is the old \"gay sex is icky\" -- which is solely a matter of taste.", "toxicity": 1, "sexual_explicit": 1}, {"text": "That guy's got huge girly tits and nipples!", "toxicity": 1, "sexual_explicit": 1}, {"text": "One-track-minded ass-hole ... :(", "toxicity": 1, "sexual_explicit": 1}, {"text": "That's Justin Trudeau for you, just another hollow suit. Empty of sincerity, disingenuous and hypocritical to the bone - ANYTHING to get elected.,\nFonda  is getting little glimpses of what Electoral FRAUD in Canada is like and Trudeau demonstrated it perfectly.", "toxicity": 1, "sexual_explicit": 0}, {"text": "No, it's called reality. She looks horrible, although I would punch the back of her throat with my cock.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Because Obama never threatened or claimed to have grabbed our pussies, for one.", "toxicity": 1, "sexual_explicit": 1}, {"text": "\" This will change his life in very difficult ways \"  ???? \n\nSNORTING COKE AND HAVING SEX WITH A TEEN WAS HIS #!&*# CHOICE !!!", "toxicity": 1, "sexual_explicit": 1}, {"text": "The feminists in the so-called feminist movement are the epitome of penis envy.  They do not like who they are.  The result being they actually denigrate the truly feminine.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I think he's just pissed that a GIRL, albeit one badass of a girl, kicked his sorry ass...", "toxicity": 1, "sexual_explicit": 1}, {"text": "What wrong with using the word pussy, ADN?  Haven't you heard the word pussy cat?  Going a little overboard in censoring aren't you?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Bill Clinton also: rapes women, penetrates women with cigars in the Oval office, hangs out with child rapists on their rapist islands, blatantly lies to the American people and perjurs himself before congress. \n\nBut ya' know, Trump followed the tax law and said some rude things about Rosey O'Donnel, so I guess that's worse?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Perfect! Just like in the campaign and her time as Sec of State when she learned how to alternate her input / output holes (mouth/butt). In other words where she mastered first talking out her ass and then farting out her mouth.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Fuck u Donald trump\n On my way! Come get me you little mouthless bitch. Fuck you!! Your a moron pussy butch bitch", "toxicity": 1, "sexual_explicit": 1}, {"text": "Don't let the door hit you in the ass on your way out!  :)", "toxicity": 1, "sexual_explicit": 1}, {"text": "Women can say what they want, but men are hard-wired to look at boobs in a sexual way. That's just reality. To argue it is ridiculous.", "toxicity": 1, "sexual_explicit": 1}, {"text": "The butt hurt is strong in this group.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Tina that is a poor excuse and he if he was grabbing pussies I doubt you were in the pool of choices.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Natural law must include rational inquiry and science or else it is mental masturbation.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Yes Akmk!  There are womyn and allies here who will vote for Hillary's vagina!", "toxicity": 1, "sexual_explicit": 1}, {"text": "So many anal people on this site.", "toxicity": 1, "sexual_explicit": 1}, {"text": "It was more cost effective to rape black, female, slaves and enslaving their children, than buying adult slaves. Rape was just a business decision and fun. The memoirs of Mary Chestnut mentions how white wives of slave owners didn't like the fact that so many of their slaves looked like their husbands.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Then keep your vagina off the Internet.", "toxicity": 1, "sexual_explicit": 1}, {"text": "It's a shame that it's going to be years before they can stick a needle in this moron's arm.", "toxicity": 1, "sexual_explicit": 0}, {"text": "The left are intolerant bullies.", "toxicity": 1, "sexual_explicit": 0}, {"text": "active: \"Which feature of this forum is bothering you? Delete or Submit?\"\n\nNeither.\nIt's the unethical re-submit you perform to run from responses when you lose an arguement.", "toxicity": 0, "sexual_explicit": 0}, {"text": "Andi Taggart, No, plpeline! Pull your little head out of your big ass sourdud!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Dumb Dumb Donald may have the smallest hands of any GOP nominee, but he proves time and time again he certainly is the biggest dick the Grand Old Party has ever put forward.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Dennis Jameson-  get that sand out of your vagina lol!!!", "toxicity": 1, "sexual_explicit": 1}, {"text": "My boss has slapped my butt a few times getting a free feel.  I just tell her not to hurt her hand:)  Come on people, sex makes the world go round.  Most situations can be handled in a tactful way.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Treasonous Trump:  \"Hey, I know I asked for Russian interference in our electoral process and got it,  I know they have me by the short and curlies because of my business ties with them, I know I have been looking like I kiss Putin's boots, but, hey, who says I am vulnerable?  Everyone else is a fool, but certainly not me.\"\n\nTypical.  But there is simply no way to escape this one through BS spin.  The guy is a major liability and the people charged with protecting America know it.  They are just doing their jobs.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Happens so often these deaths are boring. The solution to getting rid of noisy mopeds is to station plainclothes cops at problems streets communicating via cell phones. Fine the violators big time. If they do it a third time, confiscate their wheels. Cops are just too stupid and lazy to do something. Try throwing scrap 2x4's or 4x4's on the roads at night or even some large rocks. If you hear a loud crash, just laugh and go back to sleep.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Really? And hitlery is squeaky clean? lmao. That shitbag could headline with negative news for 10 years and you couldn't get all the filth off her sorry ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Fixing it...... Is killing it..", "toxicity": 1, "sexual_explicit": 0}, {"text": "big guns little dicks", "toxicity": 1, "sexual_explicit": 1}, {"text": "Or you could pull your panties out of the crack of your butt.. man-up and respect their right to free speech.. just as the blm and antifa claim.. or are you myopic?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Pornography is a facilitator for child sexual abuse.   There is no cure for this offender.  Four conditions need to exist for sexual abuse of children to occur:  a proclivity for abuse,  no inner constraints,  no outer constraints and access to children.   He need to get the maximum sentence and Alaska needs to show that it is a No Tolerance state for these types of crimes against children.  I hope the victims receive the support and treatment needed to recover and heal from their injuries.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Our justice system is extremely to lax on these assholes!", "toxicity": 1, "sexual_explicit": 0}, {"text": "Who is this \"we\" of which you speak? Are you really a woman, Lars? If not then concern yourself with your penis and other genital and reproductive parts and stay out of women's bodies.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Seriously?  In no way, has McCain or Romney has said or done the things anyway near your Trump (\"grab them by the pussy, Mexicans are rapists\", ad naseum).  Loser by 2 1/2 millions votes.  Not my president.  Now or ever.", "toxicity": 1, "sexual_explicit": 1}, {"text": "mcllum the dick always looks and sounds like he been hit on the side of the head with a shovel, what a DICK!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Thank you Kathy for having the balls to call out the spineless state senators.", "toxicity": 1, "sexual_explicit": 1}, {"text": "It's going to take someone to die before they modify safe third. Stupid and senseless.", "toxicity": 1, "sexual_explicit": 0}, {"text": "AK Coho: maybe you think that video bragging about grabbing pussy was fake?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Learn to navigate a damn airport and get there on time. That is 100% your fault. You were making everybody late.", "toxicity": 1, "sexual_explicit": 0}, {"text": "whatever happened to good old fashioned gay sex and straight sex.  The old days seem so less complicated.", "toxicity": 1, "sexual_explicit": 1}, {"text": "You're merely silly.", "toxicity": 1, "sexual_explicit": 0}, {"text": "The real problem is that Ontario & Quebec will pay real money for fabricated Californian credits. Is it just me, or is ON & QC's involvement in this pure stupidity?", "toxicity": 1, "sexual_explicit": 0}, {"text": "So... trump is clean, hilly is a dirty liar, and harry reid is just a bumbling fool. Its a baaaaddd day to be a dumocrat.", "toxicity": 1, "sexual_explicit": 0}, {"text": "This man is sickening... and makes our country look like a joke to the rest of the world. But he's a reflection of the Republican Party (not all... I know quite a few Republicans who are sickened by him too) and a boorish bully culture that rejects science, facts, education and actual news.", "toxicity": 1, "sexual_explicit": 0}, {"text": "You don't know me but I do know that someone who brags about grabbing pussy without consent is a sick f--k.", "toxicity": 1, "sexual_explicit": 1}, {"text": "In the comment that  was removed, you called me a jerk. I saw it when I was asked to judge its civility. It is one of the very few I have deemed uncivil. How about some consistency?\n\nBurke told grandparents to reject their gay children lest the grandchildren come to accept homosexuals. That, sir, is being a homophobic jerk.", "toxicity": 1, "sexual_explicit": 0}, {"text": "I just read  Harvard Hosts Anal Sex Workshop Entitled ‘What What in the Butt’, followed for a queer only talent show at Stevenson's.\nActually that's the democrat's dream, one washroom for all, same gender sex, self gratifying anal adventures. Just look at Hollywood, the ingrates get into consensual sex, then accuse their one time partner with a sexual offense or a big pay out, your choice. \nUniversities and Colleges had become an extension of decadent Hollywood celebrities.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Is that because she, like her husband, thinks with her genitals?", "toxicity": 1, "sexual_explicit": 1}, {"text": "grab her pussy, grab her pussy, grab her pussy, grab her pussy!", "toxicity": 1, "sexual_explicit": 1}, {"text": "A penis walked into a private club.\n\nThank God he was a member.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Nothing less than mutual masturbation by the purveyors of a medium that has lost touch with readers.", "toxicity": 1, "sexual_explicit": 1}, {"text": "What a crappy joke", "toxicity": 1, "sexual_explicit": 0}, {"text": "And boobs.", "toxicity": 1, "sexual_explicit": 1}, {"text": "The penis (alleged) touching allegedly happened almost 50 years ago, only to \"go public\" just before an election of the man allegedly charged with such action. Interesting timing.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Crooked ass cops.", "toxicity": 1, "sexual_explicit": 1}, {"text": "You are murdering feckless SCUM.  Your mother would slap you for being the piece of shit that you are.  I hope you die in enormous pain from cancer in your asshole that makes you cry from the pain every time you shit you fucking subhuman scum......Fuck you. I would gladly cut your fucking balls off in a minute....go suck cock you piece of shit! Fuck you and your mother you sorry fuckin swill!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Dick-ometrics.....  So.... a longer dick, like a longer password, is more secure?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Just more of trump's hypocrisy and lies.  \"Do as I say, not as I do.\"", "toxicity": 1, "sexual_explicit": 0}, {"text": "Sore-loser meltdown alert!", "toxicity": 1, "sexual_explicit": 0}, {"text": "remove their clitoris and sew their vaginas closed... alah, alah, alah Donald Trump..", "toxicity": 1, "sexual_explicit": 1}, {"text": "Well, I do.  Aside from the obvious, as TTI points out, it just adds another layer of unnecessary beauocracy, intimidation and shame to people who are already struggling. \nI find the whole attitude overwhelmingly condescending, arrogant and heartless. \nFurther, the idea of requiring anyone to vote is stupid. I'm not even going to go into thecreasons why. They're obvious.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Yeah, and her butt touched his hand...again.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Hey now, and for us who don't have dicks at all? LoL", "toxicity": 1, "sexual_explicit": 1}, {"text": ".\n.\nIs there really a God ?\n... I once thought there was even after being RAPED Physically, Emotionally AND SPIRITUALLY by my pastor, til I witnessed how these so called mEN of God(Jorge et. al.) Damned their OWN Victims.\n.\nIf there is a God...and he has the conjones to let me into heaven, after having to Live this Hell wrought by these so called mEN of God, I'm going to give him a good swift kick in the arse !\n.\n.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Masturbating in the presence of a job applicant is not 'sexual'?\n\nBill Clinton \"did not have ''sex' with that woman\", either!\n\nI am hesitant to ask what Rose thinks 'sex' is!", "toxicity": 1, "sexual_explicit": 1}, {"text": "It isn't clear why you attack the story's author.  This wasn't an op-ed piece.  It was a news article that told as much as could be discovered about the story -- so far.\nI like the silly pink hats, they show a solidarity among women that I applaud.  No one should have to worry about getting their pussy grabbed.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Get fucked asshole.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Scheer has cleaned Trudeau's clock for weeks in QP - too bad only a small portion of the electorate even pays attention.", "toxicity": 0, "sexual_explicit": 0}, {"text": "It would take a lot of practice and muscles control to vote with your vagina.", "toxicity": 1, "sexual_explicit": 1}, {"text": "HIS small white penis is showing", "toxicity": 1, "sexual_explicit": 1}, {"text": "When the permanent fund was established, the statute prohibited the legislature from appropriating any of the principle of the fund but \"permits use of the fund’s earnings for general governmental purposes.\"  It wasn't originally intended for use as a dividend program, but then if you needed the Zobel decision to get in on it, you wouldn't know that, as you wouldn't have been around when it was established and were just a Johnny - come - lately moving to Alaska to suck on the teat of the oil boom.", "toxicity": 1, "sexual_explicit": 1}, {"text": "You are obsessed with SEX!  Homosexuals form relationships the same way that hetrosexuals do.\nYou, and too many folks on this site---and in the Church seem to think that homosexual couples are only drawn to one another to perform sexual acts.  There are many straight couples that utilize anal sex as do homosexual couples.  Fr. Martin is not advocating forming a new church.  If you think that, you have not heard any of his points or presentations.\n\nSecondly, who are you or anyone to tell homosexuals to go to another church.  God hasn't denounced them----why should you?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Yea! You are a looser", "toxicity": 1, "sexual_explicit": 0}, {"text": "\"He exposed his genitals.\"", "toxicity": 1, "sexual_explicit": 1}, {"text": "If he had said he wanted to destroy Israel and kill Jews to create a Palestinian state he would still have a job.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Looks like a cute little pussy", "toxicity": 1, "sexual_explicit": 1}, {"text": "The facts of the matter will confirm that for every reasonable adult no matter which party s/he affiliates with, but it will have no effect on the fools.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Well, if you are a liberal and don't have a vagina, maybe you can copy Bruce Jenner and then you will be fine.\n\nIt's how you \"identify\" that counts!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Another reason not to vote for these two. Bye bye Lisa and Dan. Do not let the door hit you in the ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Mental masturbation? What? Your comment certainly undermines your opinion.  The nuns in parochial school would say to you: \"Get your mind out of the gutter.\"", "toxicity": 1, "sexual_explicit": 1}, {"text": "It's very difficult to find a parking spot for free. \n\nAsk any fool and they will tell you that.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Ah, the pleasures of hyperbole. . .", "toxicity": 0, "sexual_explicit": 0}, {"text": "I always did feel they came down harder on her than him. She was barred from the Grammys, but not him? What, he suddenly wasn't involved in the stunt? To cite just one example.\n\nI never understood what the fuss was about to begin with. She didn't have a \"nipple ring\"; it was what used to be called a \"pastie,\" covering the entire nipple. So nothing was \"exposed.\" \n\nWe really are hypocritcal about sex in this country.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Sounds like some of you are scared of pussy and its obvious who that is!😁", "toxicity": 1, "sexual_explicit": 1}, {"text": "What a silly hat.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Why change the context of the trial and pretend you're presenting a similar case?\n\nIf a male much larger than you held you down and tried to force his penis into your anus - would it be improper for the judge to ask why you just couldn't keep your buttocks together?", "toxicity": 1, "sexual_explicit": 1}, {"text": "A priest raping a child is hysterical.  Your comment history shows your reverence for the church and seems to be missing the teachings of Christ.", "toxicity": 1, "sexual_explicit": 1}, {"text": "The first rule of every bureaucracy: Cover thy ass first.", "toxicity": 1, "sexual_explicit": 1}, {"text": "denver has the advantage of being pussy whipped", "toxicity": 1, "sexual_explicit": 1}, {"text": "Meh, I prefer to point out your stupidity for all to see.", "toxicity": 1, "sexual_explicit": 0}, {"text": "TRUMPELTHINSKIN ADMITTED HE LIKED TO GRAB THE PUSSY!!!!\nIT IS RECORDED!!!!!!\nTHAT IS SEXUAL ASSAULT !!!!!", "toxicity": 1, "sexual_explicit": 1}, {"text": "I have to assume you are joking.  No one could be that dumb.", "toxicity": 1, "sexual_explicit": 0}, {"text": "So you have no problem with Trumps behavior. I'd love to see how you react when someone introduces himself by grabbing your genitals.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Yeah, that's what the homosexual activists call anything that disagrees with homosexual acts: bullying.  What's really bullying is sticking your penis in someone's anus.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Kissed butt.  That's ALL he's done.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Throw his lousy ass in jail !", "toxicity": 1, "sexual_explicit": 1}, {"text": "\"steal\" is right Kaka. The American people got a \"steal\" of a deal. Lowered costs and more options. Seems like the Dummycraps don't know what just hit 'em. And das a good thing. Right now they so dysfunctional it's like comedy club listening to them. Cry, whine and --tch about the Donald, yet all they get is one back slap. No sympathy for you clowns at all.", "toxicity": 1, "sexual_explicit": 0}, {"text": "False, \"While not every penis rapes, every rapist has a penis\", an emotional statement and not true.\n.\nRape is a type of sexual assault usually involving sexual intercourse or other forms of sexual penetration carried out against a person without that person's consent.\n.\nStatutory rape legal definition of statutory rape\nlegal-dictionary.thefreedictionary.com/statutory+rape\nSexual intercourse by an adult with a person below a statutorily designated age. The criminal offense of statutory rape is committed when an adult sexually penetrates a person who, under the law, is incapable of consenting to sex.\n.\nRape is a sexual assault by any gender penis or no penis!", "toxicity": 1, "sexual_explicit": 1}, {"text": "But by using a pseudonym, it does make your arguments weaker, make you less creditable because it make you sound like a coward who can say anything behind the screen without fear of consequences. You use a pseudonym to avoid the consequences of what you write...something which you clearly admitted. I am not sure what sort of business you are in but I think if you give a honest opinion, you will be judge honestly. There are very few trolls on this forum.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Better to get rid of the liberals & keep the senate.", "toxicity": 1, "sexual_explicit": 0}, {"text": "how any woman would vote for trump is beyond comprehension. may she wants him to grab her pussy!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Just another black man raping white women. \n\nShould we ban a flag or topple a statue?", "toxicity": 1, "sexual_explicit": 1}, {"text": "The p*ssy garbing liar is a racist, bigot, white supremist, nazi, sexist, Impeach, impeach, impeach!", "toxicity": 1, "sexual_explicit": 1}, {"text": "wow claiming they will kill 1000 kids is just sick trash bs ,, and makes trump voters look like angels compared to your utter garbage.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Priceless photos. \n\"Who wants this photo of the greatest president in history? Believe me, I have many, many wonderful photos for this yuge crowd which I can tell loves me.\"\nAnd of course Donald golfing on what must be an inferior course than any he owns.\nAnd my favorite #8.... \"Alright, this is the way I want you to pucker up, when you kiss my ass.\"", "toxicity": 1, "sexual_explicit": 1}, {"text": "Those stories about gay sex orgies aren't welcome at NCR.\n\nNCR delights in blaming the Church for what gay priests do, and when referencing stories of abuse, adheres to a policy of gender agnosticism re the victims of these priests.   That is, if these victims are male.", "toxicity": 1, "sexual_explicit": 1}, {"text": "fact is these showoffs should be booted from america and not allowed to come back until they apologize to all real americans and work at a real job with no pay. what a bunch of overpaid big babies who need an ass kicking.", "toxicity": 1, "sexual_explicit": 1}, {"text": "You forgot his most important stat, which is his tiny, tiny penis.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I'm afraid google is not your friend on this one.  Cover your arse, as they say.", "toxicity": 1, "sexual_explicit": 1}, {"text": "What will stupid Starbucks going to do support LBGT or Muslim believe? They should stay out of politic and stick to selling coffee.", "toxicity": 1, "sexual_explicit": 0}, {"text": "The screwing you get for the screwing you got.", "toxicity": 1, "sexual_explicit": 0}, {"text": "\"We think of all women as compassionate , when in reality—they are the mass killers we should fear the most\"  So you worry most about the attack of the killer vagina?", "toxicity": 1, "sexual_explicit": 1}, {"text": "24 yo, black kid, high speed chase, evading police. Yep, yo arsies gonna get shot off. Stupid boy. Didn't yo daddy tell you to stop, don't run, look at the police into their eyes, no make any fast moves, and keep yo hands in plain view? You ever watch COPS? The popos always run. Makes the cops angry and gives them an opportunity to beat you up, shoot you, and plant guns. It shouldn't be surprising that juries acquit the cops. If you black, you guilty and deserve to wasted. Of course they will side with the corrupt cops. You popos are way out of control all over the nation. As long as you break the rules of law and order the cops will kill you. We are tired of your lawlessness.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Pelosi would do it. Did you see the way she's been kissing Trump's ass after his inauguration? Tulsi is the most likely to beat Trump in 2020. Democrats hate 2 things - diplomacy and winning - so they can't stand Tulsi.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Well, let's imagine I create a new religion where I state the following in my holy book:\n- my religion is going to take over the world\n- anyone who does not believe in my religion is an infidel and should be killed (unless that person converts to what I believe)\n- anyone who joins my new religion then leaves it should be put to death\n- anyone who draws a picture of my prophet or insults my prophet should be put to death\n- my prophet was divinely inspired when having sex with his nine-year old \"wife\"\n- anyone who is gay should be put to death\n- a woman is worth less than a man\n\nCould I then condemn those who disagree with me as being \"phobic\" about my faith? \n\nOr, to put it another way, must we be tolerant of intolerance?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Excellent straw man. Get everybody yakking about the finances, completely dismissing or ignoring the very real threat underground. The sites could be a cluster of Burj Khalifa-sized derricks, and still not be as \"obtrusive\" as the damage to the environment happening below the surface.\n\nYes, I'm one of those, not emotionally, but logically - if one of us sh*ts the nest, we all stink.", "toxicity": 1, "sexual_explicit": 0}, {"text": "I fail to see how your post-->  \"like raping male dicks\" made it past civil or the DP.\n\nDisgusting. You promote rape while being very offensive. Appalling.", "toxicity": 1, "sexual_explicit": 1}, {"text": "These parents are a bunch of pussy ass crybabies. As a Lincoln student I personally know that approxametilie 80% of he school is white. Pat Adelman had every right to get mad at the players for being racist themselves.  The parents are to blame, as they need to pull the stick out of their ass", "toxicity": 1, "sexual_explicit": 1}, {"text": "Now \"The Mooch\" has a lot more free time to spend with his family and to \"suck his own c*ck.\"", "toxicity": 1, "sexual_explicit": 1}, {"text": "Never underestimate the stupidity of a politician.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Why are women such depraved sexual miscreant BEASTS?", "toxicity": 1, "sexual_explicit": 1}, {"text": "\"Typical behavior for folks who don't stand for anything unless it increases their vote total.\"\n\nDIW, I love you for this comment. You do realize the Republican Party, traditionally associated with smaller government, free trade, and Evangelical Christianity, is now the party voicing full-throated support for a $1 trillion infrastructure bill, massive tariffs on foreign goods, and a man who once stated gamely that he liked to grab women 'by the pussy'? \n\nA party of principles, no doubt.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I think trumpet is a complete wanker.  but ginsburg went over the line", "toxicity": 1, "sexual_explicit": 0}, {"text": "But the book by that sore loser will leave you with a sore ass if you do that.", "toxicity": 1, "sexual_explicit": 1}, {"text": "knowing that the board is inept and not doing its job, are to continue this stupidity?  don't believe the condition that existed during the massie case exists now.  the high class whites do not have much influence.  the interference during that time came from high powered white citizens who pressured governments to do as they desired.  conditions change so we should change too, clinging to old and outdated policies seem awfully stupid.", "toxicity": 1, "sexual_explicit": 0}, {"text": "What an idiot", "toxicity": 1, "sexual_explicit": 0}, {"text": "the WHORE of BABYLON is really a WHORE", "toxicity": 1, "sexual_explicit": 0}, {"text": "I'd still like to meet boots for a one-on-one scrap! Still sucking on hiLIARy's exhaust you little p*ssy!!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Ivana said Trump raped her. There's another woman claiming that Trump raped her. Trump draws the line sexually at 12 year olds. He refers to women as \"a piece ofass\". He would date his own daughter. And it's\nokay to try to fk somebody's wife and grabpussy? You bet! Have him host foreign dignitaries and their wives.", "toxicity": 1, "sexual_explicit": 1}, {"text": "biggest moron!", "toxicity": 1, "sexual_explicit": 0}, {"text": "Blah,Blah,blah. You really are nuts,,,,,penis shrinkage...LOL", "toxicity": 1, "sexual_explicit": 1}, {"text": "But, is she gonna strip?", "toxicity": 1, "sexual_explicit": 1}, {"text": "ericnorstog, IF, and I say IF, I was God, and when you come before me for final judgement, I would cut off your male sex organ, and if you are a woman, I would stitch up your pusey.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Good riddance! Loud mouth!! Arrogant!!!", "toxicity": 1, "sexual_explicit": 0}, {"text": "Sarah Palin would not have been this stupid.....", "toxicity": 1, "sexual_explicit": 0}, {"text": "As a boring, ignorant troll, you refuse to recognize the need to research a subject you are posting about.\n\nThere's no need to continue feeding HateAmericaJoe any more.", "toxicity": 1, "sexual_explicit": 0}, {"text": "So why cant we see these horny ol asses on the news?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Penis bad, vagina good.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Nitwityahoo is a war criminal and baby killer - HE SHOULD BE HUNG.  Why we kiss his ass I will never know - he is a moral pig.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Dumb owners offering dumb contracts to feed their egos....thats why I watch very little professional team sporting events.  \n\nDid not watch the Jays or anybaseball from 94 up until two years ago....Jays tweaked my interest just a little last two years.  Now back in hibernation for another 20 years.\n\nFrom what I remember I did not miss anything....  absolutely nothing.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Jeez, guys. Where do your girlfriends store your testicles?", "toxicity": 1, "sexual_explicit": 1}, {"text": "I agree; Really !! does sound like a dick.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Don't let the gate hit you on the ass on the way out, you right-wing pigeon...", "toxicity": 1, "sexual_explicit": 1}, {"text": "Rich people don't have to rape. My guess it went from consensual sex, to blackmail then rape when he didn't want to give favors.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Kiss your company's ass, snowflake.", "toxicity": 1, "sexual_explicit": 1}, {"text": "How do you know that? Have you followed every comment or are you just talking out of your rear!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Count on Trump to shift the media focus back to himself with more stupid rhetoric.  He's a narcissist.  He can't help himself.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Guess what- he's born with a penis/testicles, he's a boy. \n\n Look- schools might as well drop 'boys' and 'girls' events in track and just have everyone together compete for 1st, 2nd, 3rd, and state records if track authorities are going to no longer have one's physical equipment delineate who is  competing against whom. Makes the meets a lot shorter and this 'showboating' of specialness moot.  Just run all events together and take your awards as individual 'students' who have placed- and leave this silly, statement laden gender gerrymandering behind.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I've learned as much as I like boobs, never trust the judgment of someone with more boobs than brains.", "toxicity": 1, "sexual_explicit": 1}, {"text": "At least he HAS balls!  Obama's wife had bigger balls than HE did..!", "toxicity": 1, "sexual_explicit": 1}, {"text": "How do you spell b.o.o.n.d.o.g.g.l.e.?  To the suckers that keep voting for incumbents in the County elections year after year, you got what you deserve.  These buggers all knew this would over run years in advance.", "toxicity": 1, "sexual_explicit": 0}, {"text": "What. A. Crock. Of. Shit.", "toxicity": 1, "sexual_explicit": 0}, {"text": "All the men must love trump because he told them he has a large penis.", "toxicity": 1, "sexual_explicit": 1}, {"text": "They are not \"imposing\" anything.  If you have a problem with Catholic sexual ethics, be Protestant and have sex with whoever you want, whenever you want.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Did he hold her by the p***y?", "toxicity": 1, "sexual_explicit": 1}, {"text": "They can be so uninformed and ignorant because the bishops see themselves in Trump, and they like what they see.  Uninformed and ignorant, unrestrained misogyny, conspiracy theories, persecution complexes, superiority complexes, science deniers; they were cast from the same mold.", "toxicity": 1, "sexual_explicit": 0}, {"text": "So, according to you?\n\nReagan's Recovery was Jimmy Carter's idea.\n\nIdiot.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Typical parasite on society, isn't it time to go can your welfare check?", "toxicity": 1, "sexual_explicit": 0}, {"text": "I hope they debate social issues, I want to hear more about how Pence wants to regulate vaginas.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Well, perhaps you should ask the Canadian public if they want people who swear allegiance  to Allah over Canada in senior intelligence positions.  Sounds sensible to me.  Also, I just don't understand how you can be so hypocritical by constantly pointing out how racist Canada is while Muslim countries are the most oppressive human rights abusers on the planet.  I've lived and travelled there, and everything is racialized, women are hidden away, there's no religious or intellectual diversity allowed.  I don't like harassment at CSIS, but wouldn't it make sense to call out the far, far, far worse abuses in your culture and religion?  Or just live in a Muslim country if you think we're all so deplorable?", "toxicity": 1, "sexual_explicit": 0}, {"text": "Way to go Juli!!!!\nToo bad you couldn't grab his crotch for a good gut wrenching squeal from the ass!!!", "toxicity": 1, "sexual_explicit": 1}, {"text": "But instead of implanting it between the thumb and forefinger, they should implant the chip near a person's bung hole. Then people can drop their drawers and wave their ass around.", "toxicity": 1, "sexual_explicit": 1}, {"text": "David Weiss, Bill Clinton was getting oral sex from an intern IN THE WHITE HOUSE.  Did you think he was unfit also?  Or does that only apply to Donald Trump?", "toxicity": 1, "sexual_explicit": 1}, {"text": "How wrong you are. He has no grip on reality. He want's to turn the clock back to some imaginary nostalgia gilded past that never existed except in his own imagination. Competency is what we need from leadership not radical blind nationalism. He's not even loyal to Trump. Read what he says, listen to his words. Bannon has his own agenda and Trump was his useful fool for a time.", "toxicity": 1, "sexual_explicit": 0}, {"text": "And marijuana is illegal under federal law. Now what? Somewhere masturbation is probably illegal. Now what?", "toxicity": 1, "sexual_explicit": 1}, {"text": "A radicalized person giving the opinion on radicalized Muslims. Oh, the irony.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Don't let the door hit you in the arse, Rachel!", "toxicity": 1, "sexual_explicit": 1}, {"text": "You know, I could care less about her butt-hurt, than I do for her worthless rino father !!", "toxicity": 1, "sexual_explicit": 0}, {"text": "This is getting a little weird, folks, but really old, dry semen is harmless.", "toxicity": 1, "sexual_explicit": 1}, {"text": "eat a dick,  trump.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Butts butted in and spanked Justin's butt.", "toxicity": 1, "sexual_explicit": 1}, {"text": "\"....he grabbed my bare ass,”\n\nSo she was going commando?", "toxicity": 1, "sexual_explicit": 1}, {"text": "He has the smallest hands of any POTUS in history, and, he's the biggest dick.", "toxicity": 1, "sexual_explicit": 1}, {"text": "So if the state oil subsidy structure is so flawed why the heck are we electing oil guys to the legislature? Stupid is as stupid does.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Mulcair is an uneducated moron. Trump's policies bear little to no resemblance to those of Benito Mussolini. Mussolini's system of Fascismo had nothing to do with going against a race or religion. Fascism requires the rejection of democracy, when has Trump opposed democracy? Fascism is anti-individualist — and Donald Trump is an arch-individualist... but he is a fascist LOL He doesn't want to overthrow the existing democratic system. He doesn't want to scrap the Constitution. He doesn't romanticise violence itself as a vital cleansing agent of society, yet uninformed uneducated alt-left ignoramuses call him a fascist because? Um, well,... it sounds mean?\n\nOf course, Mulcair being a member of the Alt-left I don't expect him to actually be educated.  Him and his ilk are the only ones dumb enough to make CONservitives look smart, and considering how dumb CONsevitives are, that is one hell of a feat.", "toxicity": 1, "sexual_explicit": 0}, {"text": "No, Robert, it does not take two to create a toxic atmosphere. One is plenty.  One person can ruin a good time for others.  No liberal or conservative, it only requires one jerk.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Another brilliant lefty who has chosen to ruin his life for a petty political prank.\n\nWhat are these knuckleheads learning in school?  It certainly isn't common sense.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Ezra Levant is a complete dick, but his right to free speech must be protected.  He says dumb and stupid things but he doesn't use hate speech and he needs to be heard.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Oh shit, they've caught on......NOOOOO! Well, time to go to the next city and shit all over it then wonder what possibly could have transpired?", "toxicity": 1, "sexual_explicit": 0}, {"text": "You are making me moist with all your hot and dirty postings", "toxicity": 1, "sexual_explicit": 1}, {"text": "Wat a bunch of shit! Fake news at its finest. \"making a lot of progress\"...while golfing, using twitter and napping?", "toxicity": 1, "sexual_explicit": 0}, {"text": "So you're fine with having your pussy grabbed?", "toxicity": 1, "sexual_explicit": 1}, {"text": "According to the ATF, possession of a firearm while using Class I outlawed narcotics is illegal. There is no \"but masturbation.\"", "toxicity": 1, "sexual_explicit": 1}, {"text": "And he got to keep his penis!?  SMH", "toxicity": 1, "sexual_explicit": 1}, {"text": "That would be some erection if they did.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Who doesn't like a good \"boner\"???", "toxicity": 1, "sexual_explicit": 1}, {"text": "Which is why Christians like having sex with 13 year olds, right? I mean, that is how your good lord intended it, right?", "toxicity": 1, "sexual_explicit": 1}, {"text": "T-Rex was a pain in the ass, but not endless.  In fact they completed the project early, 22 months!, and under budget, 3.2%.    That's very telling for a construction company.", "toxicity": 1, "sexual_explicit": 1}, {"text": "First class ass", "toxicity": 1, "sexual_explicit": 1}, {"text": "Stupid is as stupid does.\n\nAnd that's all I've got to say about that.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Lets line these 5 mfrs up and just shoot them. Justice. Im sick of this crap, low life degenerates, taking advantage of law adiding citizens. This is crap and its happening every dam day...", "toxicity": 1, "sexual_explicit": 0}, {"text": "In other words exactly how the Grab Our P*ssy Party and Paul Jenkins likes it.", "toxicity": 1, "sexual_explicit": 1}, {"text": "wrong. \nViewing a body is NOT a sexual desire. Seeing that somebody has a natural huge set of breasts, OR a huge penis, OR a double Vagina or even double Penis (and yes, BOTH EXISTS), is no different than finding that a massive tumor was in say the small intestine, blocking nearly everything, and yet, the patent did not realize it. Or when a women comes in heavy but feeling funny and it turns out that she is having a baby (and yes, AGAIN, this happens). \n\nNow, if they were mishandling the body, OR were taking pix for personal use, then yeah, I have a REAL issue with it. BUT, docs, nurses, etc work on our bodies day in and day out and need to know when things are not right. They also need to know what CAN be different (which is why I like older docs for PSP and young for specialists ).", "toxicity": 1, "sexual_explicit": 1}, {"text": "Canada's ash my ass, its Alaska's ash!", "toxicity": 1, "sexual_explicit": 1}, {"text": "And yet the whore who just recently moved into the White House isn't prosecuted for the crimes she committed when she worked as a \"model\" against the provision of her visa?  I guess it just goes to show you that it matters whose cock you suck.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I don't know who the hell you are, but bite me.", "toxicity": 1, "sexual_explicit": 0}, {"text": "And yet Trump's whore wife violated the terms of her visa and has suffered no consequences.  I guess it still matters who's dick you suck in America!", "toxicity": 1, "sexual_explicit": 1}, {"text": "The Secretary of State for Texas refused aid from Quebec - said he'd rather have prayers!!!  Why do we bother to help such morons?", "toxicity": 1, "sexual_explicit": 0}, {"text": "I can tell you progressive morons \"What Happened\" for $5.99.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Hardly, we should be proud we have the \"balls\" to respect dissent as a time-honored American value!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Chick took the car and Williams dumb ass was butt hurt and now he has big boy time to do over a car that wasn't even his", "toxicity": 1, "sexual_explicit": 1}, {"text": "If it has penis he is boy, if it has clitoris she is girl.  Simple", "toxicity": 1, "sexual_explicit": 1}, {"text": "I'd rip his balls off before he even knew about it.", "toxicity": 1, "sexual_explicit": 1}, {"text": "ericnorstog,   IF, and I say IF,  I was God, and when you come before me for final judgement,  I would cut off your dick, and if you are a woman, I would stitch up your pusey.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I forgot to add that McCain would not make a good sized pimple on Trump's ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Lights,camera, action and cut. Signed, sealed and delivered. The fake president and his stupid followers. The Pied Piper leading his flock of rats into the abyss.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Trump: I kiss and grab women by the pussy and I can get away with it because I'm a star.\nWomen: That's exactly what he did to me.\nEagleclaw: I say Hillary said the N word and that's EXACTLY the same as accusing Trump of kissing and grabbing women by the pussy!\n\nOK dude. Take some meds. Go lie down.", "toxicity": 1, "sexual_explicit": 1}, {"text": "No other president was so much of a clown to have a book written that parodies him in his first year of office. Trump = the world's biggest loser ever to breath air.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Pussies", "toxicity": 1, "sexual_explicit": 1}, {"text": "on the ass, right??", "toxicity": 1, "sexual_explicit": 1}, {"text": "Should be a lesson to all men--be careful where you stick your dick!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Male genitalia are weapons of rape!!!!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Read between the lines man. HPD don't want a corrupt chief to be rewarded. What message does that send to the rank and file? Sheets and giggles Max DullSword needs to take a hike. He ain't man enough to be a commissioner. Only Sheehan is man enough.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Quit bending over letting people fuck you up the butt", "toxicity": 1, "sexual_explicit": 1}, {"text": "Super kudos and appreciation for the undercovers that got that footage. You guys have balls the size of church bells.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Well, Susan, fortunately for you, stupid, and lack of class usually doesn't show up in pictures.  Plus, you aren't winning beauty contests yourself, lady.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Thank you Rep. Seaton, Rep. Stutes, and Rep. LeDoux for your extraordinary integrity and courage. \n\nAs for the Alaska GOP, what a lot of oafs, cowards, and hypocrites.", "toxicity": 1, "sexual_explicit": 0}, {"text": "BARRY the BOY that has SEX WITH DOGS NEEDS to KEEP HIS NIGER FAGGOT ASS in the CLOSET \nNOT IN FRONT of HUMANS", "toxicity": 1, "sexual_explicit": 1}, {"text": "The background noise was Donald trying to keep the cocaine from dripping out his nose. He is a gangsta, and a maniac, he suffers from impulse control and narcissistic personality dis-orders of the highest magnitude. He is unfit to be near nuclear launch codes. He is a racist, a bigot and a complete moron also.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Exactly!  tRump is just a pig at the tax payers' expense.", "toxicity": 1, "sexual_explicit": 0}, {"text": "hey ignorant lib hyposrite, who will  be covering the wind mill costs??? answer the question!!! but no you libs are quick to attack anything oil while ignoring your own messes", "toxicity": 1, "sexual_explicit": 0}, {"text": "I wonder if he cups his nipples?", "toxicity": 1, "sexual_explicit": 1}, {"text": "`locker room accusations`  such as `grab them by the pussy`?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Both are important. Don't be that guy. When it comes to peoples misery theres not need for a dick measuring contest.", "toxicity": 1, "sexual_explicit": 1}, {"text": "He sucks their dick instead", "toxicity": 1, "sexual_explicit": 1}, {"text": "Elway is officially braindead!", "toxicity": 1, "sexual_explicit": 0}, {"text": "Overpraising dads? To become a dad one literally just has to put their penis in a vagina. That's it. It requires no special skills or abiliities at all. I don't know anyone who has ever treated a man with praise for that \"accomplishment\".", "toxicity": 1, "sexual_explicit": 1}, {"text": "Hey ass clown what exactly does it say buying comics at 40?  Could be for profit.  Does it matter?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Charlie Bussell, would you allow anyone to call your daughter \"a piece of ass?\"  Trump did.  The headline should have read,  Alaska's Creepy Clowns Back Trump.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Great actress, Great Hypocrite", "toxicity": 1, "sexual_explicit": 0}, {"text": "you could call it the penis tax !", "toxicity": 1, "sexual_explicit": 1}, {"text": "as I said before, ass****", "toxicity": 1, "sexual_explicit": 1}, {"text": "Eat a dick, trump.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Right. And \"pussy grabbing\"  is also a common form of greeting in your world, no doubt. But out in the real world kissing and grabbing a person's genitals without their permission and/or consent is a crime.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I love having an androgynous name;  I'm a woman, fucktard! I don't pay people to have sex with me!  Your wife loves to fuck me.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Go fuck your dog up his ass, you stupid cat.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Trump -----> Making a game show out of Washington\n\nWhat a complete idiot.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Yes, the VAGINA negates everything, unless it's being used for making more rethuglican rugrats, pleasure, or, on rare occasion, shooting Ping Pong balls.\n\nAt least that's how the GOP view women.", "toxicity": 1, "sexual_explicit": 1}, {"text": "shoot him already and let us through", "toxicity": 1, "sexual_explicit": 0}, {"text": "neither one of these goons sounds plausible and I don't believe Almandinger's version of his passive participation at all.  I'm only sorry David came by such scum to get involved in the first place.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Cutting various health and other services is so costly in the long run. Expect emergency room visits to skyrocket costs. Stupid and taxing as can be to cut services...", "toxicity": 1, "sexual_explicit": 0}, {"text": "You mean 'Vatic-anal'.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Need some more pitching. The old saying good pitching beats hitting. The Rocks are here to stay but the DBacks are just hot and maybe have the better pitching. As a DBack fan I still worry about our hitting. Hot yes but nowhere as good as yours. Please let's kick some LA butt! I want this to be OUR race.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Can't resist this dirty punchline... A cock in a pit?", "toxicity": 1, "sexual_explicit": 1}, {"text": "I wouldn't like to be woken with a blowjob, I was, I wouldn't call that rape.\nI'm just not very keen on blowjobs.", "toxicity": 1, "sexual_explicit": 1}, {"text": "You would have to be on drugs to have sex with Cosby.", "toxicity": 1, "sexual_explicit": 1}, {"text": "No doubt getting your butt kicked in the process.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Fat pussies?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Rex stunk like dirty feet.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Catholic priests wants all of you to \"feed their penis.\"  The priests has a message:  trust in us is to trust in God.  Ha Ha Ha", "toxicity": 1, "sexual_explicit": 1}, {"text": "... does it fold my laundry do the dishes and itch my balls ...", "toxicity": 1, "sexual_explicit": 1}, {"text": "1). No one cares about your acknowledgment, just that the legal system understands equality. You and your approval can go suck a brick.\n\n2). I assure you, lady, the parts do in fact fit. Your limited sexual experience is not a compass for thousands of years of libidinous bliss. \"God\" put a G-spot up there and erogenous tissue on the lips, nipples, genitals AND anus for a reason. I mean do you not think people are climaxing??", "toxicity": 1, "sexual_explicit": 1}, {"text": "Why dont you go shove your head up Trumpler's ass and breathe deeply . Better yet go shoot yourself", "toxicity": 1, "sexual_explicit": 1}, {"text": "Fortunately for you Obo, stupidity is allowed.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Well, this was an article that didn't need to be written!\nWe all know the slobbering media wanted an old career grifter to win, simply based on her genitalia.", "toxicity": 1, "sexual_explicit": 1}, {"text": "We are gonna send all the Muslims you can handle.\n\nThat should shut you up you globalist dick", "toxicity": 1, "sexual_explicit": 1}, {"text": "why don't we ban dummies in the government - trumpy will be the first along with his entire cabinent and staff.", "toxicity": 1, "sexual_explicit": 0}, {"text": "So Seth rich never existed and wasn't murdered? Gotcha!!! Think we know who the troll is.", "toxicity": 1, "sexual_explicit": 0}, {"text": "aa the usual lunatic back with this bs,, trump standing up for reality while you as usual live in the lunatic left ,, trump in reality vs you being a brain washed idiot", "toxicity": 1, "sexual_explicit": 0}, {"text": "And don't forget, nearly EVERY hand you have ever shook has touched a penis! GASP!\nWorried about bacteria? Wash your hands, wash your bags; it's not that hard, dude.", "toxicity": 1, "sexual_explicit": 1}, {"text": "You're lucky. My guy is a sex addict.  He goes to meetings, but he's been masturbating a LOT recently. I wish a restaurant once a year was my problem.  I worry everyday. :(", "toxicity": 1, "sexual_explicit": 1}, {"text": "Social norm my ass. When will all this traditions stop!!!", "toxicity": 1, "sexual_explicit": 1}, {"text": "\"Sodomites\"; such an antiquated phrase. I hope this means that you've never done oral sex; that too is considered sodomy. Not sorry to inform you though that the closet door is open for good.", "toxicity": 1, "sexual_explicit": 1}, {"text": "The Democrats are blowing smoke out their butts. What happened to innocent until proven guilty?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Yep, a photo of the house and no photo of the scumbag that did the crime.", "toxicity": 1, "sexual_explicit": 0}, {"text": "dude loosen up your underwear. your ass is going to explode. good grief.", "toxicity": 1, "sexual_explicit": 1}, {"text": "...Or goat orgies...", "toxicity": 1, "sexual_explicit": 1}, {"text": "This orange man is making himself look very stupid.  Opening his big mouth strongly against one China policy and now putting his foot in it.  He doesn't know what he is doing.   He must be tired of tasting his own feet.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Yes, Victoria, we are all out to destroy it.\n\nNow, would you please give us your opinion on the tens of thousands of children who were sexually abused by priests and on those Popes, Cardinals, Bishops and Vicars Episcopal and General who covered up en masse? \n\nWe're waiting...", "toxicity": 1, "sexual_explicit": 1}, {"text": "Shut up and show us your tits.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Did he then stuff the transgender's penis after castration in the transgender woman's mouth with the head sticking out?", "toxicity": 1, "sexual_explicit": 1}, {"text": "its rape, he is raped :0 lol", "toxicity": 1, "sexual_explicit": 1}, {"text": "send all the pigs down to the garbage dump (mexico) send the dick licking mayor too! Seattle is a dump.", "toxicity": 1, "sexual_explicit": 1}, {"text": "That's how you must work to think up something so disgusting.  Somebody should kick  in your Hobo balls so you have nothing to scratch.  But then again you have no balls and are just a punk arse!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Why would the EU negotiate Brexit with a British prime minister if she does not have to power to approve the terms? \n\nYou know, the Brits have gone as stupid and the Yanks. Anglo-Sexton, rise together, fall together.", "toxicity": 1, "sexual_explicit": 0}, {"text": "It's OK, potus pussy Grabber will fix it.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Touch my butt and i will show you where to discard that comment.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Jeff, please don't mansplain to me. I'm not voting for Gary Johnson because he's a hetero cis male. I'm sorry to inform you I have not internalized the misogyny that's spoon fed to us women since birth. I'm voting for Hillary's vagina.", "toxicity": 1, "sexual_explicit": 1}, {"text": "No, apparently rape is perfectly ok there though. Random beatings in the streets are ok too...", "toxicity": 1, "sexual_explicit": 1}, {"text": "Republicans have been delegitimizing government for decades.  They've also been urging followers to stockpile weapons and ammo in order to resist the deligitimized government, using the exacts words I quoted above.  This strategy that they've used to rile up voters and win elections has now bitten them in the ass.  I'm not revelling, I'm pointing out that team red should check its irresponsible rhetoric.", "toxicity": 1, "sexual_explicit": 1}, {"text": "UNACCEPTABLE!  These folks have driver licenses?  Stupidity is not a crime ..........these folks can be as stupid as stupid is but when they have responsibility for others?  Well, I'm dumbfounded.  \n\nThank you to the good Samaritans who took it upon themselves to be protectors of helpless victims of stupidity.  Thank you police too for helping us control and protect fur balls from those stupid monsters.  Okay.  Wow!  This really upset me.  \n\nI'm going to go cuddle my Ollie and Lilli.Lu.Bob.  That is all.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Stupid is as stupid does. I sure hope Governor Inslee isn't stupid.", "toxicity": 1, "sexual_explicit": 0}, {"text": "I have sexual intercourse with my wife.  No oral \"sex\" and no anal \"sex,\" both of which I would consider as acts performed or committed upon one another.  Sex is not \"making love,\" but I think that euphemism causes a lot of the confusion that people have in conflating love and sex.\n\nBiology is pretty clear about how our sex organs are to be used, for reproduction and/or satisfaction of our sex drives, best if they are performed with those whom we've promised to love for the rest of our lives.  All sexual perversions should be confessed, including those committed between husbands and wives.  I can live with confessing that; homosexuals should, as well.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Your previous post (sorry if I misread) that you can only have sex when you *intend* pregnancy is not accurate regarding Church teaching.  You don't have to intend it, just allow it.  I read your first comment, for example, to be saying that having sex with a woman who is naturally not able to conceive (e.g. after menopause) would be considered a sin.  It is not.  \n\nThe question of having sex in a way that \"avoids pregnancy\", which seems a new one in this thread, is definitely more complicated.  While the Church generally teaches that natural family planning is not sinful, it can be used in a way that the Church teaches is wrong.  \n\n The point is that we are not supposed to use people for gratification, even ourselves, even with consent. Love people, use things, not the other way around.", "toxicity": 0, "sexual_explicit": 1}, {"text": "Maybe the Ottawa yoga octopussy could call Kim up and offer him a blowjob", "toxicity": 1, "sexual_explicit": 1}, {"text": "RTH  wake up your having a wet dream.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Laughable how your dick is orange from jerking off to your own stupidity ...", "toxicity": 1, "sexual_explicit": 1}, {"text": "Fire his ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I don't know about working for Trump but it's worth noting that Trump's pick for Attorney General did say that grabbing a woman by the pussy, even without her consent, did not constitute sexual assault.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Mr/Ms. Milbank, most hunters do not want to eviscerate their target, they'd prefer to eat it!  There will always be a few idiots out there, but most people who own guns do so responsibly.  Maybe we ought to outlaw \"stupid?\"", "toxicity": 1, "sexual_explicit": 0}, {"text": "I bet your fat bitter little nerd ass was waiting all day to find a way to tie THE PRESIDENT to this. Get laid you ugly mother fu...", "toxicity": 1, "sexual_explicit": 1}, {"text": "Hey Elway, give Kaepernick a shot, what have are you afraid of, you pussy ass!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Led by Brazilian noise. Clueless illegal aliens and fools to stupid to accept reality.\nAnd the RG leads with pot shop on every block and the brainless bunch marching in what used to be a vibrant down town until the liberals got control. Did I miss anything?", "toxicity": 1, "sexual_explicit": 0}, {"text": "kiss my ass comunist Slope and pail.", "toxicity": 1, "sexual_explicit": 1}, {"text": "poor ibbitson, just cant face the facts he has been exposed for the shilling for hillary trash he was. no sense of actual journalism continues in this yet again idiot piece..", "toxicity": 1, "sexual_explicit": 0}, {"text": "nonsense - jus a plain stupid comment.  if you cant' do better than that, stop blogging.", "toxicity": 1, "sexual_explicit": 0}, {"text": "I think Americans believe their president should be free to speak to whoever he thinks best.\n\nSo PRC can go suck eggs.", "toxicity": 1, "sexual_explicit": 1}, {"text": "u bum, no stop hea.  not happy you no can figure.  boo, you suck ass; give u slaps if i see u", "toxicity": 1, "sexual_explicit": 1}, {"text": "Newspeak - You are a racist - translation - I disagree with what you said. You are a white supremacist and Nazi - translation - I disagree with what you said. Trump is a racist Nazi - translation - I disagree with what he said. We are protesting social injustice - translation - We are a pack of morons getting paid obscene money to play a freaking game shyyting on the nation that makes that possible.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Nice try you lost.\nGo scurry back under your communist rock.\nGo hug Junior. That little boy is disgrace\nHe's about to have his ass handed to him by Trump", "toxicity": 1, "sexual_explicit": 1}, {"text": "Oh please, you know I'm opposed to raping male dicks. Don't be a demagogue. Also, pretending that things that actually metaphorically happen are not happening is not civil. You don't like the metaphor, you're free to author your own, but don't change the subject away from these deplorable figuratively raping nativist xenophobic nazi-esque dirtbags.", "toxicity": 1, "sexual_explicit": 1}, {"text": "the us and other foreign corporations own everthing in canada all the oil resources commercial farms  communications weapons makers banking mining  land forests fisheries \n\neverything and the biggest owner is US \nso nafta means this \n\ncanadians not corporations the people will pay the taxes which go to the us gov which are given to the corporations\n\nthis is known as a colony a banana republic for the non third world  types that only no shit\n\nread your world history and wake the fk up", "toxicity": 1, "sexual_explicit": 0}, {"text": "And you're an expert in such matters as child sexual predation and rape? Comparing your association with Miller to that of a depraved mind and personality it takes to prey on children is akin to comparing the bieb to Jack the Ripper", "toxicity": 1, "sexual_explicit": 1}, {"text": "Trumps sexual assaults are only irrelevant to you because he's a Republican.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Plenty of boobs posting online.", "toxicity": 1, "sexual_explicit": 1}, {"text": "until they cut the genitals of a little girl and marry her off to some old creep with 3 other wives. full stop.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I guess it's insulting...if a man is as tender as the skin on his balls. \n\nI guess anyone insulted by 'cuck' really needs a safe space.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Ask everyone you meet, \"Do you have a penis or a clitoris?\" Those who aren't offended or think you're a nut will answer \"yes\".", "toxicity": 1, "sexual_explicit": 1}, {"text": "Wow! You really went to a lot of effort to do nothing more than point out a grammatical error in a compete stranger's heartfelt post. Are you that much of an ass*ole in person or only from the safety of your living room?", "toxicity": 1, "sexual_explicit": 0}, {"text": "It's refreshing to see this opinion columnist out looking somewhere other than up his own anus.", "toxicity": 1, "sexual_explicit": 1}, {"text": "http://www.torontosun.com/2015/10/24/inside-ontarios-bloated-health-care-bureaucracy\nread and learn ignorant lib sheep", "toxicity": 1, "sexual_explicit": 0}, {"text": "Still fantasizing about gay sex and male genitalia, are you? And what does that have to do with your community-vermin, disease-ridden, pestilent cats? Other than that's the only kind of lap-gratification that you'll ever get in life.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Section 160 should also be amended to include sexual acts with animals not involving penetration.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Talkeetna has never had any problem with Marijuana. I say \"Open a pot shop the size of walmart and tell those soccer moms to kiss your butt.\" It's a free country and pot is legal. Hey soccer moms,go fight something serious like meth.", "toxicity": 1, "sexual_explicit": 1}, {"text": "man you are stupid, trump is selling business for usa people and jobs etc,, just like OBAMA did pal. he is not turning his back on his platform either doing it, its business nothing else.. JUST LIKE OBAMA DID!.... , but for you ignorant alt left nut jobs there is always CNN \"news\" for the sheep on the left", "toxicity": 1, "sexual_explicit": 0}, {"text": "\"You are fascinated with sex and don't care about public policy\" says the man who tied up our entire government for a year in search of excruciating detail about a blow job.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Let's see:  Did Clinton dream about having sex with underage girls? Nope. Did he walk in unannounced on naked teenage girls in their dressing rooms? Nope. Did he repeatedly walk unannounced into the dressing rooms of adult beauty pageant attendees? Nope. Did he brag about sexually assaulting women and \"pussy grabbing?\"  Nope. \nDid he routinely try to force himself on women? Nope. Did he rape his wife? Nope. \nHave he and his wife been routinely demonized for the past 30+ years while Republican pedophiles, rapists, sexual abusers and a variety of hypocritical conservative perverts got away scot free?  Oh yes.", "toxicity": 1, "sexual_explicit": 1}, {"text": "It probably was a local.  There are way more stupid Alaskans than stupid tourists.", "toxicity": 1, "sexual_explicit": 0}, {"text": "That guy Travis Hunter, loves to fuck in little kids' beds.  Hang on to your kids parents.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Male genitals are weapons of rape!!!!!", "toxicity": 1, "sexual_explicit": 1}, {"text": "I'm surprised by the \"bare ass\" testimony.  Does she not wear underwear?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Hey Ryoko here is a master dick for you to suck.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Call your legislative rep and chew their asses. Won't help but you can get some stress out. \n\nThese guys are going to rob every working Alaskan.", "toxicity": 1, "sexual_explicit": 1}, {"text": "'\n…that's an asinine comment.\n.", "toxicity": 1, "sexual_explicit": 0}, {"text": "I’m sure this isn’t the whole story at all, I bet he provoked the dogs and got bit by one of them. They won’t attack for no reason. People need to quit pushing there agenda on others for there own stupidity.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Ugh, I can't believe this author brought up once again the \"very fine people\" comment as it relates to Charlottesville.  If you didn't understand that he meant the people who were there to protest removal of the statue, well, there probably isn't much you will understand.\n\nThe claim Trump is a white supremacist when a third of his family is Jewish is pure insanity.  What am I thinking; insanity is what defines the anti-Trump deranged folks.  I see plenty of them down this discussion thread.", "toxicity": 1, "sexual_explicit": 0}, {"text": "No , but the guy that started the whole thing is squealing, trying to get himself a good deal. You right, the cops that knew should have reported him. Their failure to do that coming right back at them, even if it was only weight room talk meaning guys just shooting the breeze while working out. I know a guy that got a great deal for squealing , the guy that convinced his partner to kill the cop that was the only witness against them Troy Barboza.  We had him in witness protection and protecting him, most disgusting duty I ever had. Williams was just plain stupid.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Fire his black ass", "toxicity": 1, "sexual_explicit": 1}, {"text": "Must suck to be white trash these days.", "toxicity": 1, "sexual_explicit": 1}, {"text": "It is irresponsible for Martin to ignore how unhealthy homosexual sex is.   \n\nBecause of PC no one ever mentions the diseases and filth that surrounds homosexual sex.\n\nTotally aside from the immorality of it, you'd think he'd be concerned about the physical health of homosexuals.\n\nOral-anal, fecal mater etc.  totally unhealthy.", "toxicity": 1, "sexual_explicit": 1}, {"text": "\"Hey everyone, look at my high-capacity penis substitute!  I'm going to flash my equipment at you!  Aren't you impressed?  God, I'm so lonely...\"", "toxicity": 1, "sexual_explicit": 1}, {"text": "Loosen up Bob and follow these four guidelines ...\n\n1) Don’t pressure your partner into anal sex. \n2) Use lots of lubricant.\n3) Use a condom.\n4) Go slowly.", "toxicity": 1, "sexual_explicit": 1}, {"text": "She's Joe miller with boobs.", "toxicity": 1, "sexual_explicit": 1}, {"text": "How did you know I was talking about grabbing women's pussies? Why you must have heard your master bragging about it on audio. And you still voted for him. \nExcuse me while I go wash my hands. With bleach.", "toxicity": 1, "sexual_explicit": 1}, {"text": "MuT:  You are right.  Shut down the pipeline, fire everybody and things will get better, yea!", "toxicity": 1, "sexual_explicit": 0}, {"text": "It's erections now ,not elections", "toxicity": 1, "sexual_explicit": 1}, {"text": "bootness, get a hold of SEDA,  he has a penis  laying around as  he  had his penis cut off...........", "toxicity": 1, "sexual_explicit": 1}, {"text": "Deport all that trash out too.", "toxicity": 1, "sexual_explicit": 0}, {"text": "They both lack testicles for one.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Dems were demonstrating projection long before Trump came along. How about this editorial board acting like they care about the results of politicians behavior on impressionable young people.  After Bill Clinton said oral sex wasn't really sex, there were numerous accounts of middle school kids performing oral sex on school buses.  Thanks, Bill.", "toxicity": 1, "sexual_explicit": 1}, {"text": "\"I'll miss his wrinkly and smelly balls\"\n-nobody", "toxicity": 1, "sexual_explicit": 1}, {"text": "The Talking head is at it again. Buying votes from the ignorant or selfish who think Ontario's coffers are limitless.\nBalancing the budget in this forthcoming fiscal 2017/18, here's what the Talking Head put out.\n\n\"By choosing to invest in economic growth and responsibly controlling government spending, the government will balance the budget, next year, in 2017-18.\"\n\nFrom the Office of the Premier, Sept 12, 2016", "toxicity": 1, "sexual_explicit": 0}, {"text": "I think O'Leary is a shallow windbag but dragging this inconsequential bit of titillation is just... pathetic. Who cares? How many years ago did it happen? Has anyone complained. This hyperconcern for every little possible faux pas is getting stupid.", "toxicity": 1, "sexual_explicit": 0}, {"text": "One group of incompetents giving an award to an individual incompetent . \nAnd they spend tax money on these stupid face saving awards .", "toxicity": 1, "sexual_explicit": 0}, {"text": "What an absurd proposal!  I hope that this law, if passed, is enforced universally and to the letter.  Make sure surgeons in hospitals cannot cover their faces since the government is supplying them the government service of light and equipment in the operating room.  Make sure you explain to firefighters that they cannot have water from the municipal mains to fight fires if they insist on wearing respirators.  Tell children there are no Hallowe'en masks in future since they may be walking on sidewalks.  At Christmas, the only Santas permitted will be ones with natural white beards public.  Make sure jet fighter pilots fly only at low enough altitudes to not require face gear.  I am sure there are many more farcical things like these that should all need to be fought out in court to force the court to drop the whole thing as the utter nonsense it is.  If the goal is \"non-secularism\" then surely all buildings of any religion should also be banned from showing any sign of their purpose.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Sex history became has been a thing since the religious right has bashed every political opponent over the head with it for nearly a century.\n\nAnthony Wiener was attacked due to sending a text with a picture of his penis in underwear in a private conversation.\n\nTrump says he wants to sexual assault women and his daughter is a piece of ass. If Anthony was fair game, so is Trump.\n\nPersonal Responsibility is the main plank of the party Trump is endorsing.", "toxicity": 1, "sexual_explicit": 1}, {"text": "What a waste of column space!", "toxicity": 0, "sexual_explicit": 0}, {"text": "JZ, you are a moron, and a Marxist moron at that.\n\nAmerica, JZ, exists because of the individual freedoms that we enjoy.\n\nThe Constitution, JZ, employs and enriches the individual, rather than the group.\n\nFascism should not be rewarded, so that liberty, and freedom may stand.\n\nYou lose,JZ.\n\nWe win.", "toxicity": 1, "sexual_explicit": 0}, {"text": "In the end he's just a kid with no new ideas. It would've been refreshing to see the end to the \"war on drugs\" maybe even a  new, compassionate Canadian direction in tackling of this deadly problem. Because it's, like, 2017 and we should try something else.  Too bad... My fellow Canadians will continue to die and we'll be served  impotent platitudes masquerading as solutions. Just another garbage politico.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Did they file a permit? What will the police do? \nSo these people think that if we all go topless, all our societal problems will go away?\nIf Taylor Swift had been topless, that guy wouldn't've grabbed her ass?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Beat me to it. TS is slim, but no transparent (and she was clothed).\n\n\"“I saw her fall into the female, and she had a shocked look,” event photographer Stephanie Simbeck said, “and I saw his hand grab her ass.”\"\n\nPerhaps she was doing the Linda Blair move from \"The Exercist\". Perhaps not.", "toxicity": 1, "sexual_explicit": 1}, {"text": "does you penis lean left?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Look another republican living in the past.  The present must be really rough.  To be clear the report says that Trump paid prostitutes to pee on the bed Obama slept it to ruin it, not that he was peed on.  He's much more of a garden variety peeping tom, opening doors he shouldn't and trying to catch women and teenagers unsuspectingly and undressed, if that doesn't work he can always grab em by the pussy.", "toxicity": 1, "sexual_explicit": 1}, {"text": "But it's biting them on the bum. No one likes to be manipulated.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Very funny!!!!.. But seriously.... There kids!!!!lets kick,them in the ass... And love them!!!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Yep, sounds like she hesitated instead of double tapping his druggie ass. Too bad, now us taxpayers will have to take care of the POS.", "toxicity": 1, "sexual_explicit": 1}, {"text": "notley is nothing but another left wing hypocritical fascist dictator!\n\nFunny how the left always has no problems attacking every religion except islam!\n\nDoes she know that Islamic schools teach students that homosexuality is evil and it is O.K. to kill homosexuals?\n\nDoes she know Islamic schools train women to be second class citizens?\n\nDoes she know Islamic schools teach regressive misogynistic practices?\n\nYea I forgot notley actually wore a hijab in one of her press releases this year!\n\nI wonder who she is really working for?", "toxicity": 1, "sexual_explicit": 0}, {"text": "Sex is not an expression of affection; it is an expression of lust, a culmination of feeling aroused by the presence/actions of another.  I don't have sex to express affection to another person; I have sex because I am aroused by that person.  No one thinks, \"Gosh, she is such a nice person that I think I will make her day and stick my penis in her.\"", "toxicity": 1, "sexual_explicit": 1}, {"text": "Anyone on this page want to discuss their opinions on my friend id be glad to do so in person . bet half of you wouldn't say any of this shit .", "toxicity": 1, "sexual_explicit": 0}, {"text": "Keep your politics out of my vagina!!!!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Oh gawd!  Another Terri Schaivo drama.  I think I'm gonna puke.\n\nWhat people are failing to see is that Trump has done nothing since he entered office except campaign for the next election.  He cares nothing about our security, standing in the world, our economy, or Americans' health & welfare.  He doesn't give a hoot about the functioning of our government - leave that to the various ideologues he appointed to satisfy his base.  He only cares about getting reelected and feeding his massive ego.     \n\nThat's why he keeps making stupid statements and taking bizarre positions.  He's not doing it for you and me.  He's doing it for some select slice of his voting constituency.  In this case it's the evangelical crowd. \n\nEvery time he opens his mouth and spews something out, ask yourself who he actually might be talking to.  He's a master of this game.  And everyone keeps underestimating him.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Dion is a fool - not sad to see the door hit his ass on the way out !", "toxicity": 1, "sexual_explicit": 1}, {"text": "So you have sex with dead animal hides?  Gross.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I think the term is anal expulsive.", "toxicity": 1, "sexual_explicit": 1}, {"text": "YES! And the obese people are toxic meat to the bears. They may kill them but they wont eat them!", "toxicity": 1, "sexual_explicit": 0}, {"text": "Hang his ass for Treason...", "toxicity": 1, "sexual_explicit": 1}, {"text": "The dollar has been stuck at 75 cents region for over a year.  I personally would like it to go to fair value of 85 cents.   Only morons would want the dollar to go lower and the costs for Canadians to go up further!", "toxicity": 1, "sexual_explicit": 0}, {"text": "She would have looked more proper with a load of my cum on her face.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Your children will hopefully understand the embarrassing history of Canada in a way you never will.  Mistreatment of First Nations people and immigrants is an international embarrassment that all Canadians should be ashamed of.  Try reading a Canadian history book under the chapters genocide, residential school rapes, land grabs, racism, immigrant discrimination and white superiority).  It is likely your children will one day have to educate their parents on the stupidity of their blind nationalism.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Welcome to best sex dating site http://wantsdate.com", "toxicity": 1, "sexual_explicit": 1}, {"text": "It rains solid diamonds on her anus.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Bad little penis! Bad! Bad!\nChoke to death on your own puke, Robinson.\nAfter you shank Harmon", "toxicity": 1, "sexual_explicit": 1}, {"text": "Psychopaths. Predators  without a conscience. If these two weren't involved in any of last year's murders than their associates,  their  crowd, themselves soon are to be. Dead.", "toxicity": 1, "sexual_explicit": 0}, {"text": "still lots of boobs though", "toxicity": 1, "sexual_explicit": 1}, {"text": "Comrade Larry: Do you believe the pussy grabbing video and audio is fake?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Happy to see you left Juneau for Anchorage Michae....One less homosexual is always good news.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Wow, you advocate for hurting somebody, yet your post is not deemed uncivil! Perhaps if a couple others flagged your ridiculous comment as such, as I have.", "toxicity": 1, "sexual_explicit": 0}, {"text": "\"the woman's testicles\"\n\n\"the man's vagina\"\n\n\"the dog's candelabra\"\n\n\"our country's integrity\"", "toxicity": 1, "sexual_explicit": 1}, {"text": "gay probably poor also otherwise he could of moved on her like a bitch and grabbed her by the pussy", "toxicity": 1, "sexual_explicit": 1}, {"text": "Aw blow it out your ass Lowinsky.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Maybe mom can get off her ass and make dinner", "toxicity": 1, "sexual_explicit": 1}, {"text": "It's obvious  that the man hates pussy, lol, I guess everyone has the right to not like something, but when you go into someone else's Place, and grab there pussy they love so much and then grab there pussy right in front of them!!, and then beat it up real bad, he must be a real bad man!!!!!!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Well, problem solved! My daughter and I will just both grow penises, and then no one will harass us either! (SMH!)", "toxicity": 1, "sexual_explicit": 1}, {"text": "Hey pal!  I'm the kid's Dad and I'm out here with a rifle, but I'm just target practicing, you selfish old pig.", "toxicity": 1, "sexual_explicit": 0}, {"text": "No worries. Pretty girls can just identify the right dick to suck. Suck it hard and suck it long. Shed the loser husband if he can't afford to buy a Toronto mansion.", "toxicity": 1, "sexual_explicit": 1}, {"text": "The only facts that matter to Trump and his supporters are the ones that comes out of his ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Sgt Schultz syndrome \"I know nothing\"!  Typical burro-crats....ass clowns in a three ring circus.", "toxicity": 1, "sexual_explicit": 1}, {"text": "They didn't discuss straight oral sex, or are you just making assumptions?\nWhat district was this?", "toxicity": 1, "sexual_explicit": 1}, {"text": "He didn't do that willingly.  It was the proscription of the Civil-Rights Commission.", "toxicity": 0, "sexual_explicit": 0}, {"text": "All I wanted to do is warn this poor lady that if the Haitians think she's with the Clintons, they'll probably eat her liver, and you scumbuckets think you'll just wipe my words away. God damn all you PC police asshole comment deleters right straight to hell. Go to Iran with your hero Hillary, and wait for the bombing. And I hope the fuck it hurts.God, please curse ALL traitor rat Democrats. Burn them in Hell, forever. That'll learn the mangy varmints.", "toxicity": 1, "sexual_explicit": 0}, {"text": "These next few months are going to be very entertaining, that previous big bag of popcorn from Costco may have to be replenished. It's a given that Trump will throw anyone and everyone under the bus to save his own ass. The big question is, how many of his little band of crooks will turn on him to save their own collective asses?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Re: the cost\n\nReports I've read put the total so far for T-rump's 48+ visits to his own golf courses at some US$55,000,000.00.\n\nTalk about sucking at the public's teat, huh?", "toxicity": 1, "sexual_explicit": 1}, {"text": "The Steelers hid. And their douche-bag coach led the way. Steeler tough, my ass. What a bunch of mindless cowards. 'Solidarity' just screwed you all in the ass. Karma's  a bitch as they say.", "toxicity": 1, "sexual_explicit": 1}, {"text": "It's propaganda so the public forgets about the real issues, like lowering the age of consent of anal sex to 16.", "toxicity": 1, "sexual_explicit": 1}, {"text": "BITCH SHOULD HAVE STUCK to HAVING SEX WITH DOGS and NIGERS\nSHE WAS AN EXPERT at THAT---", "toxicity": 1, "sexual_explicit": 1}, {"text": "Most everything Trump says can be reduced to one idea: suck my d*ck.", "toxicity": 1, "sexual_explicit": 1}, {"text": "What a piece of SHITE!", "toxicity": 1, "sexual_explicit": 0}, {"text": "Cats lick there ass right before they lick your mouth", "toxicity": 1, "sexual_explicit": 1}, {"text": "It's too bad you weren't at the orgy.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I will NEVER watch again!!!!!!!     Roger Goodell  YOU are an ASS!!!!", "toxicity": 1, "sexual_explicit": 1}, {"text": "You are mansplaining.  Hillary is an independent woman who can make her own choices just like Martha Stewart and Oprah.  You will never understand because you don't have a vagina.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Exactly. I call all comments I disagree with \"uncivil\" because that's what happens to me every time I say something like, oh, I don't know...\nThe penis is the primary male sex organ.\n\nYeah, that comment will get deleted as uncivil. Again.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Ugly ass eyesore.....", "toxicity": 1, "sexual_explicit": 1}, {"text": "we put up with bull moose floating down the rivers with no heads from the so called \"sport hunters\", who value only the horns, who obviously have penis envy", "toxicity": 1, "sexual_explicit": 1}, {"text": "It begs the question \"why would you want to\". The vette is, and always has been, nothing more than a penis extender.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Telling people to shut the f*ck up and calling them ignorant is the lefty version of civility here I guess.   Lots of us have read Gramsci, and the writings of the Frankfort School, and, yes, Saul Alinsky; we understand the communist march through the institutions.   Into the 50s progressive was a synonym for communist, and a \"progressive person\" was a trusted fellow traveler but in a position where s/he couldn't be an open, card-carrying member of the Party.  Liberal became the substitute for use in polite company during the Cold War years until failed liberal policies made liberal a pejorative as well.   The government schools had done a good enough job of revising and air-brushing history that by the 90s it was felt safe to go back to the term progressive.   Some of us do know history and know that you've exposed yourself as either ignorant or a liar, but I'm confident you just think of yourself as \"educated.\"", "toxicity": 1, "sexual_explicit": 0}, {"text": "Of course the comment you refer to is more funny than anything else, but basically it is some sort of underhand advertising.  I think it is meant to illustrate that this comment section does not want to provide a forum for advertising especially not to witchdoctors and penis enlargers. I fully agree with that.", "toxicity": 1, "sexual_explicit": 1}, {"text": "This shit is what happens when you live in a theocratic fascist Oligarchy.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Because Hillary was smart enough not to attack the mother of dead Benghazi Soldier. Trump is too stupid to let this go. He keeps digging himself in deeper. \n\n\"When he isn't the center of attention every minute of every day, he is compelled to seek out that limelight no matter the consequences.\n\nIt's not a disease - a disease can be treated. No, Donald has an extreme personality disorder - one that makes him unfit to hold public office of any kind.\"", "toxicity": 1, "sexual_explicit": 0}, {"text": "Hey, why was my comment removed?\n\nI was simply reporting that the moth named after Trump has a small John Henry.\n\nOr can I not use the word 'penis'? (Wonder if this will be depleted? Still figuring out the words that we can use and not use.)", "toxicity": 1, "sexual_explicit": 1}, {"text": "What's your basis for comparison?  Japanese Americans from the concentration camps cried loudly enough to get $ in reparations.  If that's the standard, how much is slavery worth?  Women getting their pussies grabbed?", "toxicity": 1, "sexual_explicit": 1}, {"text": "You do nothing but repeat your tired, ridiculous, incorrect, nasty accusations.  You report nothing correctly...you do not seem able to.\n\nYou, Sir, are the liar - mired in your own odd perceptions.  Stop calling people names.  \n\nConsider this post of yours finally flagged...", "toxicity": 1, "sexual_explicit": 0}, {"text": "Oh please! Let the UN clean up it's own back yard regarding racism, human rights, violence against women with all the despotic countries that belong to it. The UN is an impotent, corrupt and useless organization.", "toxicity": 1, "sexual_explicit": 0}, {"text": "You mean by the pussy.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Naive female. Don't go to a man's apartment unless you want to be penetrated.", "toxicity": 1, "sexual_explicit": 1}, {"text": "And yet the MSM still rants on about how stupid Trump is...", "toxicity": 1, "sexual_explicit": 0}, {"text": "Ha, when I have sex with my wife, I only care whether she is a willing participant,  To the extent that she enjoys it just increases my pleasure, but that is an ego thing more than it is an unselfish loving act on my part.  The fact is, neither my wife nor I require sex in our marriage, except that it was the way we conceived our children (a very big deal).\n\nThe unifying aspect of sex, imo, is the pleasure given to the man makes him less likely to go looking for sex from another woman and for both parties to threaten the end of sex if the other is caught with another.", "toxicity": 0, "sexual_explicit": 1}, {"text": "These are the same punks hiding in safe rooms on campus. They find actual work repulsive and choose to live in moms basement and scream about trump winning cuz they might have to lose their freebies and get off their ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Hmmm...sex while flying on autopilot. I'm having a tough time believing that one.  I guess we'll see.", "toxicity": 1, "sexual_explicit": 1}, {"text": "The whole range of actions, from groping to rape, all fall under the single charge of sexual assault.", "toxicity": 1, "sexual_explicit": 1}, {"text": "A PROVEN LIAR saying someone else is not telling the Truth? Implausible, in-imaginable and totally unlikely for ANYONE other than a dTrump0 to 'tell a lie about something so important'. 100% belief-factor to the Widow....and a whopping -394% to the immature, puerile, sociopath, bully-boy President of the USA!  Hey, even Clinton had more guts than D-Goofball 2017...at least he finally admitted that he lied about getting a blow job from Monica!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Why don't they reproduce the photo with the skirt she was wearing? It certainly doesn't look like his hand is up her ass, maybe on the outside but not up it. Also wouldn't she jump if someone put a hand up her ass with no panties?", "toxicity": 1, "sexual_explicit": 1}, {"text": "That link didn't say a single word about ERMUHGOD GAY ORAL SEX!!!! HOT, HOT MAN ON MAN ORAL SEX!!!111", "toxicity": 1, "sexual_explicit": 1}, {"text": "You reminded me of the fish cop years ago who told me he would recommend to people who carry hand guns...\"file off the front sight, so it wont hurt so much when a bear shoves it up yer ass\".", "toxicity": 1, "sexual_explicit": 1}, {"text": "Kudos to Mr Chong for being the only candidate who assumes Conservative party supporters may have both consciences and intelligence, rather than trying to herd them around with pleas to intolerance, suspicion, and magical thinking, like the rest of the crew he's up against.\n\nClimate science is science. Enough with grown adults spouting about whether they \"believe\" it or not.  It is science, the same thing that has led to our ability to fly, to create and use computers, to build bridges and buildings that don't collapse in a breeze.  We don't spout about whether we believe that science - we're just darned appreciative of it.  Ridiculous to read about politicians pandering to those who prefer to believe something other than what science informs us, especially when our planetary existence depends on our acting on that science.\n\nThe rest of the folks running for leader are either wilfully ignorant or amoral.  Time for Conservatives to stop voting for lying losers.", "toxicity": 1, "sexual_explicit": 0}, {"text": "All we need to know is how to kiss our ass goodby.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I believe the original quote was \"ass, gas or grass.... nobody rides for free\"....... had it on a tee-shirt but sentiment understood", "toxicity": 1, "sexual_explicit": 1}, {"text": "Lame ass", "toxicity": 1, "sexual_explicit": 1}, {"text": "Trump makes it clear: Trumpcare is all about the tax cuts to the rich.\n\n\nThat part he's crystal clear on, he's not confused or crazy-sounding. \n\n\n\n\n     He's got this part down pat—taking health care away from millions is going to be a huge boon to the wealthy, \n\n\n\n\n      \"tremendous savings\" in taxes.\n\n\n\n\n      That's all this has ever been about—now we've got it straight from the ass's mouth.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Sort of like a limp penis you might say.", "toxicity": 1, "sexual_explicit": 1}, {"text": "More silly chicken little views of Trump......color me surprised.", "toxicity": 1, "sexual_explicit": 0}, {"text": "To Kevin Burns, way to kick someone when their down. Real men speak with their fist not a keyboard. Btw, how's your hepatitis C doing from sex with that gay hooker?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Ass hole little girl!", "toxicity": 1, "sexual_explicit": 1}, {"text": "If you're to squeamish or immature to say \"penis\" and \"vagina\" you should probably just keep your uninformed opinion to yourself.", "toxicity": 1, "sexual_explicit": 1}, {"text": "MOST PETS of PROGRESSIVES are SEX TOYS for the FAMILY\nNIGERS LOVE PIT BULL PENIS---\nBARRACK said it TASTE LIKE CHICKEN\nMIKE BARRACKS MATE said BARRACK COULD TAKE AN ANAL DB with DOGS THREE TIMES a DAY\nEVERY CALL to PRAYERS EVERY MUSLUM OFFERS HIS ASS to the DOGS---\nand THEY LOVE IT", "toxicity": 1, "sexual_explicit": 1}, {"text": "sidd fynch: did you also explain to your children about grabbing a woman by the pussy?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Sounds like you like your pussy grabbed huh moron?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Just another shallow egomaniacal feminist libtard.\nBlow it out your ass, Honey.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Ah. So it goes like this:\n\nWhite with penis=automatically meritorious\nNon white, perhaps without penis=obviously NOT meritorious", "toxicity": 1, "sexual_explicit": 1}, {"text": "Shove it up your ass you crazy bastard", "toxicity": 1, "sexual_explicit": 1}, {"text": "Pussy is my life.. D. Trump, The Art of the Deal.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Hurray for your Pussy Grabber in Chief! Go grab them pussies Putrumpski! Amirite?", "toxicity": 1, "sexual_explicit": 1}, {"text": "lick my nuts.", "toxicity": 1, "sexual_explicit": 1}, {"text": "As my girlfriend likes to say:  \"Nice car.  Sorry about your penis.\"", "toxicity": 1, "sexual_explicit": 1}, {"text": "If my dog was an asshole, and I knew they acted aggressively to strangers and I still let them out in my front yard without obvious restraints and someone shot them, then no, I wouldn't be concerned. I would expect it.", "toxicity": 1, "sexual_explicit": 0}, {"text": "I reckon it was a penis problem, hahahahaha", "toxicity": 1, "sexual_explicit": 1}, {"text": "It takes a majority to bring articles of impeachment. Do the crazy Dems have a majority?", "toxicity": 1, "sexual_explicit": 0}, {"text": "RD, does that mean Donald trump won't grab women by the genitals anymore?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Pepe: assuming you are a woman, I want to grab you by the pussy.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I don't buy into the bible, peddle your wares elsewhere.  But let me leave you with a favorite quote of mine \"Suck my dick\" Ron Jeremy", "toxicity": 1, "sexual_explicit": 1}, {"text": "My...what good fortune,  That means that only half of Aboriginal children were subject to sexual abuse.  What prize does our country win for that?", "toxicity": 1, "sexual_explicit": 1}, {"text": "\"An intrinsic part of the sacramental sign of Holy Orders is the manhood of Christ.\"\nFascinating.  So Jesus, even now, having returned to his fully divine existence, still has male genitals.  Who would have thought?", "toxicity": 1, "sexual_explicit": 1}, {"text": "The General is saving his ass, if he doesn't agree with Trump ( YOUR FIRED )", "toxicity": 1, "sexual_explicit": 1}, {"text": "One crooked ass talking to another crooked ass?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Amen to that...Greenberg wouldn't know a conservative if one came up to him, yanked down his britches and planted a Hillary button on his behind.", "toxicity": 1, "sexual_explicit": 1}, {"text": "\"You fault a man for gawking at the female body, but won't criticise women who do the same thing.\"\nWomen do not share penis pics with girl friends and gawk at them.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Isn't it such a great feeling when you find a twisted way to justify your hatred of everyone that doesn't have white skin and a penis?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Oh great.  here we go with the leftist crap again...   unbelievable.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Dunno why but whenever I hear the name \"Max Sword\" I get a picture in my mind of an erect penis.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Her big butt was a target !", "toxicity": 1, "sexual_explicit": 1}, {"text": "The lifetime racist born and bred by his racist father escaping with just fines for denying apartments to ethnic groups even veterans after WWII with Roy Cohn as lawyer.  The heritage and ongoing truth of lifetime of racism with advisors right out of the White Supremacist league, i.e., Bannon.  Just one more disgusting lie.", "toxicity": 1, "sexual_explicit": 0}, {"text": "The decision to circumcise should indeed be a personal decision, made only by the person who owns the penis.", "toxicity": 1, "sexual_explicit": 1}, {"text": "More like a testicle of himself", "toxicity": 1, "sexual_explicit": 1}, {"text": "This man is a hero! If Pebble doesn't like you, you're doing something right.", "toxicity": 0, "sexual_explicit": 0}, {"text": "\"DO SOMETHING!\"  \n\nHILARIOUS. Literally begging on twitter to be saved.  What an embarassment..and people still support this jack ass.  Absolutley bizzaro world we live in now.", "toxicity": 1, "sexual_explicit": 1}, {"text": "\"Questions about what's between their legs\"\nAs opposed to what, a vagina?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Where is your husband to fill that filthy mouth of yours with his cock?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Please quote the \"Rape\" lyrics to support your claim.\n\n.. because you appear to be confused.  There is no rape in the song.  At no point is anyone forced to do anything against their consent.\n\nThe man in the song is clearly offering a sexual encounter.\nThis is not rape.\nThis is not illegal.\nSex is different than rape.\nProposing to have a sexual encounter is not rape.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I bet its a lie, lets see the cut scene phony ass", "toxicity": 1, "sexual_explicit": 1}, {"text": "You want cock in a mancave? Please take your porno elsewhere", "toxicity": 1, "sexual_explicit": 1}, {"text": "Are you projecting your convictions of masturbation? Left field from a lefty doesn't equal a right.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Leggings are fine, somewhat like thicker panty hose.  However, at least wear a very long shirt or sweater to cover your bum.", "toxicity": 1, "sexual_explicit": 1}, {"text": "President lied under oath about consensual sex...\nNot the same thing as rape.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Yes, suck it did.  It sucked.  Sucked eggs.  Sucked the hind teat.  Sucked like nothing's ever sucked before.\n\nBut, for a suck-up like you who's been sucked in since forever, just suck it up and hope you suck out.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Donald Trump makes a couple rude remarks and the world is in an uproar,,, however Hillary Clinton commits numerous felonies and crimes against America and no one pays the least bit of attention,,,, come on folks get your collective heads out of your ASS.", "toxicity": 1, "sexual_explicit": 1}, {"text": "You voted for that moron, Trumpski. Anyone who did that has not only lost all relevancy, but all self respect.", "toxicity": 1, "sexual_explicit": 0}, {"text": "GO TRUMP GO TRUMP, I LIKE ALL OTHER GOOD AMERICANS SUPPORT YOU 100%\n\nYou poor Demcratic fools quit crying, get over it YOU LOST!!", "toxicity": 1, "sexual_explicit": 0}, {"text": "There are many heterosexuals that participate in oral and anal sex. It seems that Catholics used to punish them for these acts as well as for taking pleasure with a spouse for vaginal sex IF the purpose was NOT procreation. Should we torture and burn hets for those reasons as well?", "toxicity": 1, "sexual_explicit": 1}, {"text": "\"Tax his land,\nTax his bed,\nTax the table\nAt which he's fed.\n\nTax his tractor,\nTax his mule,\nTeach him taxes\nAre the rule....\n\nTax his car,\nTax his gas,\nFind other ways\nTo tax his ass.\"", "toxicity": 1, "sexual_explicit": 1}, {"text": "The current con legislative majority is a joke. Telling the electorate to buy a building for 32 or 12 million $$$ vs. moving to the Atwood, makes them sound like the bigger fools and you sound like a joker's joke.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Where are the crowds arguing for it?  There has basically been dead silence on the issue.  Why feed the Conservatives that opportunity?  That would be plain silly.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Close your legs if u dont want to get preggo. \n\nGet on birth control even if youre not sexually active and happen to get raped. There are kinds that are good for your skin.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Why do gay people always have to think we care that they are gay? Do heterosexuals go around telling everyone, \"Oh by the way, I'm heterosexual\".  Do what you do and shut up about it!", "toxicity": 1, "sexual_explicit": 0}, {"text": "Because he has the testicles to do it. only with the approval of the Legislature which has the constitutional power to override his veto.", "toxicity": 1, "sexual_explicit": 1}, {"text": "You are right.... couldn't get past the part where he talks about grabbing pussy, where he makes fun of the disabled,where he talks about building a wall, and kicking out Muslims.  How can you love this country if you do all that?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Russian patsy, my hairy ass! Go back to your cave, Communist.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Kent calling it \"mind rape\" when people argue that she should support her party's nominee diminishes the violence of rape and shows no respect for the right of others to self expression.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Good riddance to bad trash. Please go back to your radio show, Ms. Clark. Or better still, just go away entirely. Your dubious \"services\" are no longer required.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Did John exercise good intentions when having sex with a fifteen year old? Was he practicing safe sex and his condom broke? \nYour defense of the murdering child rapist makes my head spin!!", "toxicity": 1, "sexual_explicit": 1}, {"text": "What \"little tidbit?\"  When you are grabbed by the genitals without warning by a sexual predator that is not \"permitting\" anything.   \"According to legal documents, Trump has been accused of raping a 13-year-old child, raping his ex-wife, and attempting to rape a former business associate. He vehemently denies all of these accusations—and it should be noted anyone can file a civil complaint in court, and a complaint is by no means proof of allegations. That being said, the accusations are chilling...The first and most famous accusation comes from Trump’s ex-wife Ivana Trump. During a deposition in the ’90s, Ivana described a harrowing scene in which Trump held her arms back, pulled at her hair, and raped her in a fit of rage. She herself used the word “rape.”....\"  then there's the 1997 lawsuit  filed by Jill Harth for unwelcome sexual advances and \"attempted rape\"...the 3rd lawsuit was filed this year, wherein a woman claims she was raped by Trump when she was 13 years old.  Fusion.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Nor do they have a penis.  And, the ones I know usually had ovaries, a vagina, and a uterus along the way in their lives.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Just another little Carol C. does not any body remember the Carol jerk she could spend more money than anyone worst than Obama. I would like to know what in the hell did Ed Graff do wrong, I never reason any reason why, maybe he did not kiss ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "After every hurricane. Lets just propose a cap on flood insurance and see who screams like a bunch of stuck pigs. Enact it and see how fast a carbon tax is enacted.", "toxicity": 1, "sexual_explicit": 0}, {"text": "More simply, Trump said that in effect Hillary of all people fooled him into making a fool of himself by fooling a whole of people to believe what he was saying had merit. IMHO someone who believes a fool is a fool. So did HRC herself make Trump act so stupid..?", "toxicity": 1, "sexual_explicit": 0}, {"text": "Who to believe... the woman who say they were sexually harassed,  or the guy that brags about grabbing women by the pussy?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Why would small hands stop bullying when he is ensconced in a security shield? The pig is a coward, a cheat, a bully, a bigot. And, lest we forget, he can pick women up by the pussy.", "toxicity": 1, "sexual_explicit": 1}, {"text": "This country runs on sex and gasoline.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Wow, thanks for that totally irrelevant and ridiculous post, when they win the National Championship will you say Rambo could totally kick Jason Bourne's but?", "toxicity": 1, "sexual_explicit": 0}, {"text": "May continues to lead the UK into 3rd-tier status.  But those fools who voted for her will reap the weakened UK that is beginning to show now.", "toxicity": 1, "sexual_explicit": 0}, {"text": "F*CK ISNTREAL", "toxicity": 1, "sexual_explicit": 0}, {"text": "Trump can grab my pussy anytime!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Thanks, your right I do have the perfect ass, ask your mom.  Thanks again, and have a wonderful day!!!!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Yes, for the sake God the almighty please give Trump a chance.  Because Trump basically is Jesus and is in no way the total and complete opposite of Jesus.  After all Jesus hung out with prostitutes so he could grab them by the pussy and kiss them without their consent, right?", "toxicity": 1, "sexual_explicit": 1}, {"text": "A PhD only gets you so far down your own particular rabbit hole. A PhD in nano-robotics would probably laugh out loud about another PhD's assertion that we'll always be able to \"tell the difference...\" They would probably laugh out loud that is, if not for the fact that they're busy having sex with a Robot.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Child rape is cool, if the right people do it.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Oh, so now it is oh-so-Christian to vote for a guy like Trump who has defrauded his investors, refused to release his tax returns, grabbed women by the pussy and bragged about it, and has been married 3 times?  Ha-ha, you guys were used big time.....  and don’t you think that most Christians would want to see health care for the people and aid to poor folks?  That’s what Jesus would do, but not Trump — he’s the exact opposite, distributing income to the rich.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I've always had a soft spot for this passage of the Bible:\nYet she increased her prostitution, remembering the days of her youth when she engaged in prostitution in the land of Egypt. She lusted after their genitals – as large as those of donkeys, and their seminal emission was as strong as that of stallions.\nEzekiel 23:19", "toxicity": 1, "sexual_explicit": 1}, {"text": "David Mueller lost his job for grabbing Swift's ASS. He didn't brush her ribs, he grabbed her ass. He wanted a piece of Taylor's ass, so he grabbed her ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Stupid! \n\nGet rid of prayer, period. \n\nBalance my balls on your nose!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Kelly and Trump have at least one thing in common. They are both inept and clueless buffoons.", "toxicity": 1, "sexual_explicit": 0}, {"text": "This Pribus-Scaramucci kerfuffle is identical to the Trump-Sessions kerfuffle.  It's how Trump sends the MSM down yet another rabbit hole while creating drama that facilitates the actual objective:  routing the actual lawbreakers / leakers out.  Relax Newt.  This is how a New Yorker confronts a bully:  Walk right up to them and kick the straight in the balls.  I like it.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Trump's an evil sociopath without a hint of empathy for the Americans he's supposed to serve; he instead caters to the selfishness and greed of the minority, who provide him with the worship he needs to feed his narcissism.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Its kind of like all those sexually abused Hollywood women who are now coming out of the wood work by the hundreds exposing their tormentors,even old HW Bush got his dick slapped for pinching some woman's ass from the confines of his wheelchair.The demo's will sing like canary's once the first ones start chirping.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I call BS, someone is covering thier butt, that\nor they are being blackmailed. Maybe clinton\nat one of thier coked up pedophile orgys got\nsome pictures.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Luckily, Daddy Trudeau's Charter is very clear: it's not wrong to discriminate against penises, only vaginas.", "toxicity": 1, "sexual_explicit": 1}, {"text": "funny what they'll do when you can speak in complete sentences and don't grab women by the pussy.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Oh c'mon you can write about the anal sex joke running in the first movie, hardly a spoiler now.  More of the same now?", "toxicity": 1, "sexual_explicit": 1}, {"text": "we see the results of the meat salvage by the trophy hunters. Above all else save the antlers. Goes along with penis envy I suppose.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Easy now Kellyanne, it isn't like Weinstein was audio taped bragging about grabbing women by the pussy or anything.", "toxicity": 1, "sexual_explicit": 1}, {"text": "You both are SICK FUCKS AND SHOULD ROT IN HELL.I HOPE YOU GUYS FEEL THE RAPE WRATH WHILE YOU TWO ARE IN PRISON AND IM SURE SOMEONE WILL VIOLATE YOU AS YOU TWO DID AGAINST INNOCENT CHILDREN .AND THE MAN IN THIS CASE SHOULD HAVE HIS PENUS AND BALLS REMOVED AND HIS HANDS CUT OFF AND HIS TONGE REMOVED AND FOR THE LADY ACTUALLY I CANT EVEN CALL THEM MAN / WOMEN YOU TWO ARE A WASTE OF HUMAN FLESH DISCUSTING .", "toxicity": 1, "sexual_explicit": 1}, {"text": "When your priests are having sex whit little boys you don't need condoms.", "toxicity": 1, "sexual_explicit": 1}, {"text": "But obama did do most things in a juvenile manner, hollywood just licked his ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "No. Your confusing same-sex acts with masturbation.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Lying ignorant psos....", "toxicity": 1, "sexual_explicit": 0}, {"text": "LOL\n\nNever heard of male masturbatory toys, hmmm? May be why you're so uptight.", "toxicity": 1, "sexual_explicit": 1}, {"text": "so have you ever been asked to use a condom during sex? and if not was your response that lets go to Burrito Boy? you are an enabler to child sex abuse", "toxicity": 1, "sexual_explicit": 1}, {"text": "That's quite an erection.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Your inane comment makes you look ignorant and immature.", "toxicity": 1, "sexual_explicit": 0}, {"text": "The penis is one organ of waste extraction. You can have an orgasm in the other  one. None of it is as straightforward as you claim. But then again, neither is sex.", "toxicity": 1, "sexual_explicit": 1}, {"text": "i think if they can get into a garage and grab tools....a lock on a hidden door between a house and garage isn't going to stop them.. nothing is foolproof to a sufficiently proficient fool.", "toxicity": 1, "sexual_explicit": 0}, {"text": "So oil is up, jobs in Canada up, Dow is up,\n\nWhy the Foch is the stupid Lame TSX down again?\n\nSomething really fishy going on here.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Thurston is loaded with deplorable losers, druggies, drop outs, thieves, and sex offenders.\nClean up your own backyard first before rattling off complaints about Eugene.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Disgusting attempt at trolling. Flagged.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Mental Illness at work again, again, again, again.............This women placed a clamp on the boys genitalia.   This woman SHOULD have a clamp placed on HER INNER and OUTER LIPS of her VAGINA...........and Never Removed.............", "toxicity": 1, "sexual_explicit": 1}, {"text": "Oh, our legislators have testicles.  Big brass ones.  Look what they're doing to us in the full light of day.  No fear.  No shame.", "toxicity": 1, "sexual_explicit": 1}, {"text": "ADN censors a penis but not the bloody head of the president? Interesting.", "toxicity": 1, "sexual_explicit": 1}, {"text": "crybaby.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Ridiculous trash-talk.\n\n/..", "toxicity": 1, "sexual_explicit": 0}, {"text": "\"Minority-laden\" implies nastiness to you? Take your racist ass somewhere else.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Isn't it a shame we lack the balls to do the same thing here?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Rich people get good lawyers and avoid fair punishment. Poor people get screwed by the legal system. \nWe have always screwed over the poor and always will.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Vow Donald Trump's face is as flaccid as his\npenis.\nIt's probably the same color.", "toxicity": 1, "sexual_explicit": 1}, {"text": "And taxpayer dollars should not be the currency used for reassignment surgery, period. This goes for Canada as well. I'm all good with you knocking off your pecker but certainly not on my dime.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I've actually experienced sexual harassment and groping.  I never would have offered to perform oral sex on any of those men.  Monica's goal was to service the president.  The president was very wrong to accept it and lie about it.  I think it's time for your silence.  You, as a man, have no credibility mansplainin' to female victims of sexual harassment and assault.", "toxicity": 1, "sexual_explicit": 1}, {"text": "This was the old pedophiles plan, jt's daddy.\nGet Canadian women into shallow thinking,\nhave abortions at will, we will replace these \npeople with murderers, thieves, pedophiles,\ncome on people, look at the kiddie porn coming\nin with jt's border jumpers. he is replacing us with\nscum, and then he will allow free murder of our\npeople. with it being a murder charge against \nus defending ourselves from his illegal immigrant\nborder crashers. Kick this bum to the curb, charge\nhim with treason, tear down any and all statues\nof any trudeau and destroy it. It's our history\nthese scum are trying to remove to replace it \nwith stinking muslims.", "toxicity": 1, "sexual_explicit": 0}, {"text": "You got me all fucked up, homes.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Hey, Dickhead, kiss my ass.  We DON\"T have any children!", "toxicity": 1, "sexual_explicit": 1}, {"text": "I love ejaculations, trite or otherwise.  I used to earn indulgences for pious ejaculation.  So much fun and salvation, all wrapped up in one package.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Throughout human history wise and inspired people have passed on to others the knowledge they have received and tested for themselves for accuracy. This is what we call education. It is what our brain uses to advance the best ideas and apply them to problems for the best solutions.\nScience refers to this as the Scientific Method. Regressive thinking denies the value and worth of advanced education. We are confronted with the results of their uninspired world view every day. For proof, look at the decision by Trumpet to leave the Paris Accord, which brought nations together to solve an obvious catastrophic and predictable disaster, all because of his idiotic America First agenda of \"show me the money and the hell with you losers\". Or, as it is properly known \"the Bannon plan\" of nationalistic isolationism.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Even a eunuch likes oral sex.....", "toxicity": 1, "sexual_explicit": 1}, {"text": "Donald Trump is a big, hot, mess.", "toxicity": 1, "sexual_explicit": 0}, {"text": "I am very tired of taylor swift and her ass", "toxicity": 1, "sexual_explicit": 1}, {"text": "Then show me the vagina.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Cue the long list of post writers who will condemn the North Korean regime for its prisoner abuse, for its dishing out punishment far in excess of the crime in question, for its cruelty, and in defense of the young man in question, with no criticism about his actions and his decision-making.\n\nOh, no, wait, there is only a long list of post writers when it is the American government and a Guantanamo prisoner.\n\nFree pass to the Korean government, let's have some popular posts with lots of agreement star votes (as happened in the related story a few days ago about this case) pointedly judging the young man as very stupid and condemning him for his stupidity.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Hannity with boobs...", "toxicity": 1, "sexual_explicit": 1}, {"text": "Whatever....  Damn,   I got another major venture leaving again Friday...  Be out a touch for another 10 days.....   That's what happens when you know more in life than making holes in donuts for bakers dozens.", "toxicity": 1, "sexual_explicit": 0}, {"text": "We don't need to know how we are getting ripped off day after day month after month and year after year with this Rail. Write something else. You know the cost will not remain at 8.2 billion especially when the deadline is 2025. We don't need depressing news every morning when we wake up. Just let us know when we can hop on the damn thing.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Guess Jesus must have been pretty dumb then.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Show us your tits, Justin!\n\nMaybe the media should do more than scream at Justin to take his shirt off.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Cut the crap!  next thing you know, they'll be asking for a $500-million stadium.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Do you have a link to this bit of fake news?\nWould you be OK with a woman laying down naked in a girls locker room forcing kids to see her genitals?\nThat's inappropriate behavior no matter what!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Thankfully America is smart enough to not give these democrat morons any power....for now.", "toxicity": 1, "sexual_explicit": 0}, {"text": "To what end is he showing us his \"balls:?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Paul - So when your teenage daughter is showering in the girls locker room at school and a teenage guy who identifies himself as a girl showers and walks around with his penis exposed, are you ok with that?\n\nhttp://dailysignal.com/2015/12/21/why-these-high-school-girls-dont-want-transgender-student-a-in-their-locker-room/", "toxicity": 1, "sexual_explicit": 1}, {"text": "a great story about dicks that finally moves the other dick down south off the front page", "toxicity": 1, "sexual_explicit": 1}, {"text": "I think he's brave but ignorant, as most people would be nowadays.  If he was dumb he would likely be dead.  I suspect he's a smart cookie.", "toxicity": 1, "sexual_explicit": 0}, {"text": "How about our very own Pono Choices…teaches kids that buttholes are sex organs.  They’re not.", "toxicity": 1, "sexual_explicit": 1}, {"text": "You don't go to men's locker rooms, because your penis is embarrassingly small, and you have a sunken chest.  Am I wrong?", "toxicity": 1, "sexual_explicit": 1}, {"text": "We street proof kids why not rape proof women. Intoxication and sexual assault is a reality.", "toxicity": 1, "sexual_explicit": 1}, {"text": "This is a little more than \"sex outside of marriage,\" Liam!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Neither Kennedy nor Clinton have been shown to have assaulted anyone whereas Trump proudly boasted about how he likes to grab women's genitals and about the \"fact\" that he can get away with it because of his celebrity.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I am sure Bush was sexually aroused by touching her.  After all, he was only 90 at the time.  He most likely wanted to grab her by the boobs, but he couldn't stand to do that so he did the next best thing and grabbed her by the butt.  Dirty old man.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Kick ass! You give me hope with your little finger.", "toxicity": 1, "sexual_explicit": 1}, {"text": "U \nLike\nSucking\nBlack\nC\nO\nC\nK", "toxicity": 1, "sexual_explicit": 1}, {"text": "I hope this scumbucket Hancock is victimized by an illegal and is taught a lesson.  But I bet he's too stupid for that.", "toxicity": 1, "sexual_explicit": 0}, {"text": "The Trump-Russia scandal is unraveling even faster than the sex abuse scandal in Boston during 2002.  Every time one of the Trump team's previous lies is exposed they have to make a new one.  Let the impeachment hearings begin.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Where did I say this lawyer is corrupt? I don't know him well enough to make that determination. He represents corrupt individuals. He's the go-to guy when you need to defend your sorry ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "The Globe puts the anal in analysis.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Shove it up your fucking ass and burn in hell.  Your God damned states that have legalized the weed, whether for \"medical\" use or otherwise, have seen a significant increase in highway deaths.  I wonder where the God damned Mothers Against Drunk Driving whores are...", "toxicity": 1, "sexual_explicit": 1}, {"text": "There go those penises again, always thinking with their.....penises...?", "toxicity": 1, "sexual_explicit": 1}, {"text": "All you human worshipers should put yer money where yer mouth is, and have sex with an AIDS-ridden black African, and see how multiculturalism works for you.\n\nJust don't ask me to pay for yer sex disease.  And I don't care about any sick bastards you produce, either.  Let them die before yer eyes,  maybe you'll learn something.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Hey pretty boi -- get on your knees and give her a good arse licking", "toxicity": 1, "sexual_explicit": 1}, {"text": "I think you have it backwards.    Harper had a hate-on for the press because he lacked the skills to deal with them.   Every previous PM (Liberal and Conservative) had their issues with the press.    Only Harper played perpetual \"victim\".\n\nHarper came under the same scrutiny that any Canadian leader faces.    He also had the same fawning press when he first took power.     He was just too inept to take advantage of it.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Some people are too stupid to have a social media account.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Hahaha. What was on the upswing? I've seen nothing to show any upswing but go look at all my comments around election time for any source I give. Obama was a failure , bush was a failure and Clinton was a failure. I never said Clinton started war on drugs I did however rightly point out that he expanded it. Not changed by ending the disaster but expanded it. Next since when is any fact site that can be edited by absolutely anyone better than anything. Come on. Pull your head out your ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "You think grabbing women by the genitals isn't a moral issue, loser?", "toxicity": 1, "sexual_explicit": 1}, {"text": "You do realize that the overwhelming majority of anal sex that takes place in America is heterosexual anal intercourse, don't you?", "toxicity": 1, "sexual_explicit": 1}, {"text": "PS: Kardashian Kudos to the Post for editing story and reinserting ass...so to speak.\n  \nSay, since we're talkin': kind of a big hole in this story: exactly why is DJ boy suing Swift? What did she do that torted him all up? You got some 'splainin' to do here. Where/when did she allege this stuff that he's suing her over? \n  'nuther thing: You got this standing there as if it's a fact in the story;;; better attribute it up the ass:\n\"Mueller then thrust his hand underneath her dress, latched onto her bottom, and held on even though she moved away from him, leaning closer to Melcher.\"", "toxicity": 1, "sexual_explicit": 1}, {"text": "ericnorstog:\n\"Did you read the letter? It talks about rape, not consensual sex.\"\nAhhh...but \"therein lies the rub\"- The evening's festivities may start with consensual sex, but AT ANYTIME , during, or even days or weeks Later, the woman may decide to reclassify the entire incident as \"RAPE\"! \nTo be a young man Entrapped in such a situation is something I would not wish on an enemy!\nBut we instill in the youngest females that \"It's Ok, honey, you are not responsible for anything!\" EX: A very young (10) girl crawls out a window to meet a 21 year old man, She is completely blameless? and her Parents?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Only $10,000 bail for someone with multiple previous convictions and history of sexual abuse of a minor??", "toxicity": 1, "sexual_explicit": 1}, {"text": "she had spunk", "toxicity": 1, "sexual_explicit": 1}, {"text": "\"can state raise taxes to give me more on my welfare?\"\n\nA better solution would be for you to get off your lazy butt and get yourself a JOB.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Now that he's put Mika and Joe in their place, it's time for some pussy grabbing!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Just another sore loser.", "toxicity": 1, "sexual_explicit": 0}, {"text": "The place is a cesspool of neglect, poverty, criminality and desperation. Its population is a volatile mix of locals, immigrants (many of whom are illegal), workers, unemployed and criminals. To top it all, it resides on a steep slope. \n\nI have no idea how the authorities think they can make this place liveable, without spending hundreds of millions on terracing and installing sewerage, water and power. It is also probably one of the most dangerous spots in the city. \nBlocking will require some form of census, and many if it's residents don't want that, for obvious reasons.\n\nThe only way to get it right is for the community itself to identify the criminal elements that live among them, isolate them, and then participate in the \"blocking\" as temporary city employees.  The city will have to break its own laws to expedite this process.", "toxicity": 1, "sexual_explicit": 0}, {"text": "I do not deal with blacks if I can avoid them; at a check out counter I will always wait or go out of my way to go to a White person or an East Indian or an Oriental. On a professional basis it is get me the Jew or a White or a Oriental or an East Indian...never ever would I deal with a black and IQ is the whole story, and the rest is world wide common sense.", "toxicity": 1, "sexual_explicit": 0}, {"text": "It's the Republican ethos--\"just grab 'em by the pussy\"--and the rich get what they want at the expense of everything and everyone else.", "toxicity": 1, "sexual_explicit": 1}, {"text": "And where did you get your climatology degree?\n\nClearly you haven't read any studies on climate change (World temperatures have NOT been stable for the last 20 years, but have gone up 0.5C).\n\nStay in your Trumpian bubble, but please stop subjecting the rest of us to your ignorance.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Only a fool thinks the Globe and Mail is the radical left.", "toxicity": 1, "sexual_explicit": 0}, {"text": "You really struggle staying on point, don't you?  This is the DNC West that we are talking about, formerly led by that great women's rights champion Harvey Weinstein, friend of Obama and Hillary and great contributor to democrats everywhere.  Hillary, that great champion for women, taking money from a rapist.  If one is going to renounce sexual harassment, one shouldn't be married to a guy who was a serial harasser while taking money and cuddling up to Hollywood where it goes on with reckless abound.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Just checked it out on Google Earth.  There's some idiot waving his arms with a laundry basket.  This is why I've worked so hard all my life, so my family doesn't have to live in a dump like this.", "toxicity": 1, "sexual_explicit": 0}, {"text": "more left wing stupidity since the usa economy is where the world covets to sell to period..", "toxicity": 1, "sexual_explicit": 0}, {"text": "So if a restaurant owner puts up a sign saying \"No Blacks Allowed\", you're a-ok with that? Because that is the logical end of what you're saying.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Read book \"One Second After\".  Congress needs to get off their asses and protect the grid!", "toxicity": 1, "sexual_explicit": 1}, {"text": "STFU NEWT! what happened to the man who forced \"contract w/America\" down throats of unexpecting Dems? Get ur testicles back!", "toxicity": 1, "sexual_explicit": 1}, {"text": "dat dumb hat he wears is finally shrinking his brain..............", "toxicity": 1, "sexual_explicit": 0}, {"text": "Nothing like a little pussy for stress relief.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Get a life you lazy broke ass...", "toxicity": 1, "sexual_explicit": 1}, {"text": "NIGERS and SNOWFLAKES USE THIS DOG CRAP ---\nTHE DOGS are SEX PARTNERS for these PROGRESSIVE FRUIT CAKES\nJUST LIKE BARRAK the MUSLUM FAGGOT---they LIKE A DOG IN THEIR MOUTH and ASS\nASK MIKE---BARRACKS MATE about DOG SEX---SAID BEST THING SINCE FAT SLUT WHITE GURLS", "toxicity": 1, "sexual_explicit": 1}, {"text": "Maybe the media should take their heads out of their butts and start  looking for the truth instead of trying to smear the President.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Yeah .   I'm sure a bag was never .....ever opened to oggle a nice set of boobs.  Give me a break.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Agreed. Truly pointless talking truth to power because they know that already.\n\nThe people who should be getting schooled are the voting fodder who are in love with politicians and don't realize they are just convenient fools in this game.\n\nNever ever fall in love with politicians! They are scum", "toxicity": 1, "sexual_explicit": 0}, {"text": "suck my d^^^...read that", "toxicity": 1, "sexual_explicit": 1}, {"text": "They had sex 2 1/2 times that day?  \nI dunno...maybe we need details---that part has my interest.  ; )", "toxicity": 1, "sexual_explicit": 1}, {"text": "giving what away? alberta boomed under tory control and made billions in royalties for social support.  the ndp is not at fault for the price of oil but niether are the torys from before, the NDP are at fault for increasing taxes and making business less competitive now. save the insults too but that shows you are the one with the lack of intelligence issues", "toxicity": 1, "sexual_explicit": 0}, {"text": "Her having a vagina makes it exponentially easier to stay completely hidden.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Nobody deserves to be isolated more than this putrid debacle of a \"president\".", "toxicity": 1, "sexual_explicit": 0}, {"text": "What are you going to do about the oral cavity? A Dr. Lecter  type mask (with lock)? How about the anus?", "toxicity": 1, "sexual_explicit": 1}, {"text": "They blow it out their ass and hope we don't say it stinks...too rude, sorry. trump builds on the shoot from the hip to blow out his behind.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Sex in public restroom and rape are already against the law. Perhaps the minnerites have a self control problem and we need protection from them.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Stuff your dictatorial crap.", "toxicity": 1, "sexual_explicit": 0}, {"text": "The separation of recreational sex from procreation may save humanity from a crisis of overpopulation. And if men enjoy masturbating to porn more than actual sex, so much the better when it comes to sexually transmitted diseases.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I feel like I'm living in a true-to-life version of the cult movie \"They Live\".  It's just that scary, because how long can this imbecility go on where such utterly bought and sold individuals continue to fool a significant portion of the populace?  Folks, it has to stop.  If the vote means *anything* anymore, please vote these idiots out of office...", "toxicity": 1, "sexual_explicit": 0}, {"text": "R I D I C U L O U S !", "toxicity": 1, "sexual_explicit": 0}, {"text": "again you alt lefties are ignorant of facts,, \n\nlast year of bush, deficit was 458 billion\nthen 8 years under obama they were in order, 1.4413 Trillion, 1.294 Trillion, 1.295 Trillion, 1.087 Trillion, 679 Billion, 485 Billion, 438 Billion then 587 Billion,, the deficits are ANNUAL not accumulative that is the total debt buddy... and obama ran most of his years far worse than bush ever did...\n\nso take your ignorance and learn facts before you look so stupid", "toxicity": 1, "sexual_explicit": 0}, {"text": "as usual anything you post is immediately put into disrepute being the lunatic you are", "toxicity": 1, "sexual_explicit": 0}, {"text": "On the other side of the coin:\n\n\"A judge has reopened a major legal controversy by ruling that accused people can claim they were too drunk to be found culpable of committing crimes.\nPresiding over a sexual assault case in Southwestern Ontario, Mr. Justice Terrence Patterson of the Superior Court of Ontario ruled that Parliament violated the Charter of Rights with a 1995 law that prohibits the so-called defence of excessive intoxication.\nThe ruling opened the door for Carl Frederick Fleming, 62, to argue that he was too drunk to appreciate his actions when he sexually assaulted a St. Thomas, Ont., woman in 2009.\"\n\nhttp://www.theglobeandmail.com/news/national/judge-reinstates-controversial-drunkenness-defence-in-sex-assault-case/article578863/\n\nSo, in this case one of the old boys club (aka judges) decided that a man can be too drunk to sexually assault someone..but on the other hand, a woman who is too drunk to control her own bladder can consent to sex.\nSomething has to change.", "toxicity": 1, "sexual_explicit": 1}, {"text": "4... so you press your body harder against his, feeling him swelling against you. Sexual assault?\n5. He is moving backwards, and you press him up against a wall, and you have decided that whatever your misgivings were earlier, you are ready now. You take your blouse off, pressing your chest against him, stroking him... sexual assault?\n6. He pushes you back, and you drop to your knees, pulling his zipper down in the process. You hold him again, and now he is moaning, you hear him say 'oooohhh...'\nSexual assault?\n7. You kiss him fervently, undoing your own pants....there is no doubt that he is ready now. As you stand again, the last of your clothing falls to the floor. You turn, his moaning exciting you further, and your hand wraps around him tightly. You hear him going \"oooooohhh,\" which causes you to pull him into you, and you push your hips back against him quickly. Rape?\n\nYou found him to be passionate, and willing, yet an hour after he leaves, two stern police officers... cont'd", "toxicity": 1, "sexual_explicit": 1}, {"text": "What a loon. She's better thank her lucky stars the employees and fellow customers didn't wipe the floor with her chirpy ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I can't wait to throw that bum Seaton out.", "toxicity": 1, "sexual_explicit": 1}, {"text": "What self-respecting Democrat would attend the inauguration? Trump's a self-admitted rapist. I think the people who did attend who were Democrats did so out of respect for the institution of the office rather than out of respect for Donny. \nnoun. 1. unlawful sexual intercourse or any other sexual penetration of the vagina, anus, or mouth of another person, with or without force, by a sex organ, other body part, or foreign object, without the consent of the victim.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Was that before a black man went to an English court in Virginia and got it to \"award\" him, a former black indentured servant as a life-long  slave? (In the 1600's?  The 1st documented \"slave\" in the American colonies?) There were free blacks who owned black slaves.  Slavery was economic, not racial.  As for the 2nd amendment, neither the government nor the Constitution grant \"rights\". The Constitution lists the most important, which is directing the government to guarantee and protect them, nothing more or less! Man has had the natural right to self protection since the dawn of time.  And if you're referring to \"stealing\" a country (I'm assuming vis a vis the \"indians\") they weren't indigenous, they also came from somewhere else....and eliminated the peoples here before them.  Perhaps you should apply your same standards to the daily massacres committed BY blacks ON blacks in all  liberal controlled inner cities, like Baltimore, Detroit, Chicago, etc.  liberals are such hypocrites.", "toxicity": 1, "sexual_explicit": 0}, {"text": "A pervert getting away with a crime is no cause for celebration.  A \"not guilty\" verdict does not make the accuser innocent.  He got off on a \"made-up\" and manufactured technicality.  Thanks to a overly sympathetic & \"politically correct\"  judge.\n\nHe raped a minor .... forcing oral sex upon his victim.   To the judge I ask What part of that is so difficult to understand?", "toxicity": 1, "sexual_explicit": 1}, {"text": "It's those damned Lutherans again!", "toxicity": 1, "sexual_explicit": 0}, {"text": "next time, just bare your big butt, hahahahaha", "toxicity": 1, "sexual_explicit": 1}, {"text": "Apparently Powell is perahps not alone in his possible effects to expose Hillary. After watching liberals all morn fill their pants on MSNBC, CNN, ABC over FBI Director James Comey’s latest Clinton revelation the only thing I have to try is not to laugh so hard at Hillary and many fools. \n\nTalk about \"Try a little harder next time.\" Maybe you have an entertaining democrat party excuse as to why this morning in light of Comey’s latest Clinton revelation Madonna has doubled down on her offers of free oral sex to every man in America who votes for Hillary Clinton.", "toxicity": 1, "sexual_explicit": 1}, {"text": "It's OK a black man call you a white trash,  but if you say they are black, you get arrested for being a racist.  They pretend to brush it aside when ISIS killed innocent people and they are OK to let Muslim women wear Burqa on our streets but you wear a Great America hat, you are fired. They don't respect democratic vote and pretend to embrace in democracy.  Fck all these liberals idiots, they will turn your kids into Muslims one day.", "toxicity": 1, "sexual_explicit": 0}, {"text": "OregonBorn: Look at what the Catholic Priests have accomplished over the last how many centuries, AND, the Boy Scouts of America. They have been raping boys, FOREVER.\n\nRead the Sign: FOREVER................", "toxicity": 1, "sexual_explicit": 1}, {"text": "Now \"The Mooch\" has a lot more free time to spend with his family and to \"suck his own c**k.\"", "toxicity": 1, "sexual_explicit": 1}, {"text": "The moth is named after Trump.\n\nThe moth has a tiny penis.", "toxicity": 1, "sexual_explicit": 1}, {"text": "The poorly educated white folks? where did you come up with that racist bile? I've got a much better education than you do Charles and I voted for Trump, campaigned for Trump and supported his campaign, what would make you say something so breathtakingly stupid?", "toxicity": 1, "sexual_explicit": 0}, {"text": "Did nobody think to make a penis shaped hat for Trump to wear?", "toxicity": 1, "sexual_explicit": 1}, {"text": "DOGS----\nEAT\nSHIT\nSLEEP\nBARK\n\nNIGERS\nEAT \nSHIT\nSLEEP\nRAPE\nMURDER\nSTEAL\n\nDOGS and NIGERS---PAST TIME to EXTERMINATE the FILTHY NON-HUMAN MONGRELS", "toxicity": 1, "sexual_explicit": 1}, {"text": "Only vain idiots have millions of dollars in jewelry.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Tell your detractors to haul a ss into the bush and get their own damned tree.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Obviously Trump's a scumbag, but then again, so are the people who voted for him.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Mayor Jennifer, welcome, your Worship!  John Tory just didn't have - your balls,", "toxicity": 1, "sexual_explicit": 1}, {"text": "Well, at least you admit it: \"Having sex with my wife is not a matter of showing my love for her; it's me acting on my sexual drive.\" \n\nWow! I think she can get an annulment for that.   \n\nAgain, at least you're honest to admit it to us. When did you tell your wife what primarily--and primally--\"drives\" your lovemaking? \n\nAnd how 'bout your kids? \"You're here because of Daddy's primal  urge to act on his sexual drive with Mommy\"! \n\nAnd I'm curious, where does your wife's sexual drive and desires fit in? Or are you promulgating the long-disproved lecture of Fr. O'Brien to the sophomore boys: \"Men and women have different urges. Men want sex more than women do.\"", "toxicity": 1, "sexual_explicit": 1}, {"text": "That is the problem. There are some penis's out there wanting to use the vagina restroom, and some vagina's wanting to use the penis restroom. Understand?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Uh...what an ignorant answer. I grew up in a family business that failed after 20 + years. My mother was left with a big mortgage & other debt while in her mid 50's. My father died within 3 years of the business failing at the age of 61. All of his life insurance had been cashed in to pay his employees. All of his RRSP/savings were used to try to keep the business afloat, to no avail. I might add that my father volunteered to go overseas for 5 years, serving in the RCAF in England & Burma/Myanmar...but he was a stiff from West Saint John, NB. Can the Prime Minister make that claim? Where did his father serve while my father was hospitalized for months & pumped full of anti malria drugs over that 5 year period? And that was the easy part!!", "toxicity": 1, "sexual_explicit": 0}, {"text": "Absolute bullshit these losers were still able to get behind the wheel. We have the technology, we need to install DUI ignition tests on EVERY vehicle. I wouldn't care if the drunk drivers were the ones dying - I'd call that justice - but we lose thousands of innocent people to drunk drivers all the time and we have the technology to PREVENT this! Right now you are o lay made to get a DUI ignition breathalyzer AFTER you have been busted for DWI. I'll pay extra for my family and friends' safety. These drivers are KILLERS. They should be hung and done. Take a life, you should lose your life. \n\nIn fact the damn driver inmates should be making these things. They don't need to be paid, we are already housing them for free. They can make these and it would be so much cheaper to make this mandatory for every vehicle on the road.", "toxicity": 1, "sexual_explicit": 0}, {"text": "And I lost my arse when I partnered in a Jeffrey Dahmer cookbook.", "toxicity": 1, "sexual_explicit": 1}, {"text": "No, because they are Democrats they wouldn’t know a fact if it bit them in the ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "he was just joking - said Sara Huck-sand\nhe can't take a joke about the size of his weenie, but he jokes about nukes", "toxicity": 1, "sexual_explicit": 1}, {"text": "You may be correct.  However it's you knuckleheads who have thrice carried this sham of a Liberal government back into power.  Truth sometimes hurts, eh!", "toxicity": 1, "sexual_explicit": 0}, {"text": "Actually if you follow the timeline of when they commented compared to when the article was updated with the name you'd see that it wasn't publicly available on ADN until after they asked that question. Try to use some sort of rational thought process before getting too excited and commenting like that. Dick.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Now that's a good example of anal retentive.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Jesus wept, did you even read the article? He undressed her, felt her up, and forced her hand on his erect penis. That's a class C felony you're pretending to be a good example of impulse control. Disgusting.", "toxicity": 1, "sexual_explicit": 1}, {"text": "May these craven whores go down in ignominy with Trump.", "toxicity": 1, "sexual_explicit": 0}, {"text": "So tell us roldrik, which nipple are you sucking your 'news' from?", "toxicity": 1, "sexual_explicit": 1}, {"text": "this is why idiots should have electric fences rather then guns.", "toxicity": 1, "sexual_explicit": 0}, {"text": "We really are the stupidest country on earth.  Played for suckers.  No other country on earth would pay this guy.  If he has a grievance against anyone, it should be his parents.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Dumb and dumber out doing daddy's bidding - like daddy doesn't have his hands on the reins?", "toxicity": 1, "sexual_explicit": 0}, {"text": "the vagina tape? is that the one with the monologue?\n\nor maybe you mean the secret penis transcripts from brazil or the missing buttocks documents the brits uncovered a few years back?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Wow.  The Senate pretty much told the orange one to suck eggs.  Now the Coast Guard is too?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Yep! Sure looks that way. A couple of wanna be bad-asses with a gun.", "toxicity": 1, "sexual_explicit": 0}, {"text": "I know Huh what a Jerk", "toxicity": 1, "sexual_explicit": 0}, {"text": "\"Anyone blaming this on whites...\"\n\nUm, what?\n\nAs I look at photos in the Virginia town of the violent terrorists and their Nazi-like military gear, I do not see any Japanese or Chinese or Indian or black folks amongst them.\n\nSo I guess I think it is okay to blame the problem there on certain white folks...", "toxicity": 1, "sexual_explicit": 0}, {"text": "“I did try and f*** her, she was married,” and says that when he meets beautiful women he feels able to “grab them by the pussy”.    “I did try and f*** her, she was married,” and says that when he meets beautiful women he feels able to “grab them by the pussy”.   Our Dear Leader in his own words,    I'm glad we're both christians....lol & aloha", "toxicity": 1, "sexual_explicit": 1}, {"text": "Stolen \"from\" her?  Seriously?  The single most criminal politician in American history, and you feel the election might be stolen \"from\" her?  What pathetic liberal crappola you've been drinking!", "toxicity": 1, "sexual_explicit": 0}, {"text": "So when do we put a bag over Trudeau's head for destroying white culture in Canada with Muslim and Chinese immigration??\n\nNow this crap.\nHey Indians !!1\n\nIf you worked more, like the rest of us, Instead of sucking at the taxpayers teat every day - you wouldn't have time to fuss over who kicked your asses", "toxicity": 1, "sexual_explicit": 1}, {"text": "Is there any landmine the tiny fisted fascist will plant that the idiot media will not step on?\n\nThis is just a trick to distract from the real storie(s).  The fact he has ties to Russia.  Also the fact he is profiting from his office by not totally removing himself from his real estate company.   Also the fact they are gutting Medicare/Medicaid. The list will keep getting longer and he will keep dreaming up new ways to make the media chase around his laser pointer like the stupid idiots they are.", "toxicity": 1, "sexual_explicit": 0}, {"text": "You sound like an ass.", "toxicity": 1, "sexual_explicit": 0}, {"text": "I understand that she is equally proficient doing the alternate oral-anal thing...", "toxicity": 1, "sexual_explicit": 1}, {"text": "Oh do not forget Madonna promising a blow job if you vote for Hillary........\nTHIS is how over the top nuts they are.....sad.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Why don't you explain to me the evolutionary value of a man sticking his penis in another man's bum and how whatever value you can find offsets the potential for anatomical damage and infection that it creates.  Seems to me that that is what makes the inclination and learned behavior in response intrinsically disordered.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Liberals are just useful idiots and aren't even fun to play with.   The serious apparatchiks are a bit of a challenge and there is some sport in that.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Black Lives Matter is hypnotically dramatizing George Owell's story, \"1984\".  I read the book in high school in the '60's and never imagined there would be any citizens so stupid a to suppress free speech in America. Both Antifa and BLM have done so by trying to harm people who want to speak.  Pathetic.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Alceste, you are a woman's sexual organ", "toxicity": 1, "sexual_explicit": 1}, {"text": "The annual orgy for the wealthy and their chefs.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Why don't the Liberals do something useful other than pander to an extreme left wing contingency with trinkets and trash.\n\nOur economy is in decline and quality manufacturing jobs are leaving! But nope we need energy efficient toasters! It's foolishness that has led to Kathleen's demise! \n\nTruly I get people wanted change but this administration is akin to a university student council. \n\nJobs people!! \n\nEnd the endless campaigning and get your act together, you look foolish.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Officer, thats not MY Penis in her.  I do not know how it got there...............", "toxicity": 1, "sexual_explicit": 1}, {"text": "hugh:  YOU must be  using LSD?????   Sure sounds like it.............\n\nYOU stated, \"we all know a church has never caused anyone any harm in the history of the world\".   YOU must not be from this world.  What about the thousands or tens of thousands  of Catholic Priest's that have RAPED young boys and continue to do so?????", "toxicity": 1, "sexual_explicit": 1}, {"text": "Sharia law, FGM, child brides, murdering gays and apostates, etc. have no place in my Canada.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Just old and anal lol .", "toxicity": 1, "sexual_explicit": 1}, {"text": "The jc hospital is a lawsuit waiting to happen, mental health in eugene is treated worse than prison. How dare the city take life from people in the land of the free because you do not take the time to understand individuals. Its a pitiful shame to force people on drugs because your stupid.", "toxicity": 1, "sexual_explicit": 0}, {"text": "'Immigrant' my ass!  ILLEGAL ALIEN, LAW BREAKER, INVADER.  Throw them ALL out.", "toxicity": 1, "sexual_explicit": 1}, {"text": "love it get rid of the two imbeciles", "toxicity": 1, "sexual_explicit": 0}, {"text": "Totally agree. Not to mention that shopping around tax returns is a felony for whoever gave it to the NBC. The NBC could not legally release the vagina tape, so, as we recently learned, they leaked it to the WaPo to derail Trump's campaign. New low for the media.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Trust Trudeau, lover of dictators, to kiss a murderer's ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "At least in the recent past there are 1.5 oil spills A DAY in Alaska (pipeline and/or drllling). Their safety record is assuring giving us even more faith in the industry's integrity, competence, responsibility, and priorties. Drill baby drill my ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Yah, I hate it when the ladies wave their penises around . . .", "toxicity": 1, "sexual_explicit": 1}, {"text": "I hope the judge's 18 year old grand daughter is lucky enough to be drunk in a cab and then 'consent' to have sex with a smelly cab driver.\n\nHey judge, she was falling down drunk, but she said yes, so its okay that I had sex with her, correct?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Driving like that is why people are going to soon attempt to argue that AI-driven vehicles should be mandatory. Just as a point of order, it might help if there were more signs indicating \"left lane for passing only,\" idiots being what they are.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Go suck his d!ck.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I didn't know finance industry criminals had testicles.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Party over Country - it's the Grabbing Our Pussies Party way!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Open and transparent my ass. When pigs fly.", "toxicity": 1, "sexual_explicit": 1}, {"text": "What part of we-are-shareholders don't you get? Handout, my arse.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Waaaaaaa Waaaaaaaaa \n Do you like it with the Trumpelthinskins grabs your pussy?\n Is that what you're going to teach your daughter is OK?\n Or maybe your son did you teach your son that it's OK to grab the pussy just like the president of the United States Trumpelthinskin???\nI USE ALL CAPS SO YOU CAN HEAR ME ABOVE ALL THE GOP NEO NAZI SPEECH!!!!!!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Grab him by the pussy", "toxicity": 1, "sexual_explicit": 1}, {"text": "Nor can you prove what you're saying. You're full of hot air and bullshit. We're just opening a window to get a little clean air in the comments section.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Hockeytown, if a persons vote is a private issue, then why isn't a woman's vagina a private issue?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Ha ha ha ha ha ha ha ha ha ha ha ha! \"Let us resolve that if they come for any of us — Muslims, Hispanics, blacks, gays, women, geeks (like me) — they may as well come for all of us.\" What does that even mean? Damn, these freakin people are coming unglued.", "toxicity": 1, "sexual_explicit": 0}, {"text": "All Muslims are terrorists, that is a fact, they either pull the trigger or support those who do.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Good article Austin. Unfortunately, those rabid fans you spoke of can't get their head out of their arse and realize we are talking about a 6 year old girl here.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Oral sex isn't really sex, according to Bill Clinton.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Boy, that's for sure. Facebook had very poor security early when it first hit the street. Not convinced that it ever improved that security I decided putting my personal life on the world wide web was pretty stupid using this platform. Imagine all your personal data coupled with your financial data combined for sale on the dark web.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Trump just has another month before his Supreme Court pick is in place.  Chin is just peeing into the wind. This is nothing but mental masturbation.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Go join your butt f--king buddy", "toxicity": 1, "sexual_explicit": 1}, {"text": "“You know, it doesn’t really matter what [the media] write as long as you’ve got a young and beautiful piece of ass.” DT", "toxicity": 1, "sexual_explicit": 1}, {"text": "More crap by leftists who only want their \"approved\" opinions aired.  All others are of course racists and bigots and hate speech.  Not how this country works sweetie.  And by the way, it wasn't a girl the article was about - a girl has a vagina - not a penis and testicles.  Maybe you need to educate yourself a bit more.", "toxicity": 1, "sexual_explicit": 1}, {"text": "SO trump sexually assaults people, but the real problem is language pointing out that he's a pussy grabber?", "toxicity": 1, "sexual_explicit": 1}, {"text": "And you know this how? Do you have inside information that know one else has or are you just talking out your rear?....", "toxicity": 1, "sexual_explicit": 1}, {"text": "AirMiles used to be good, but now it pretty much sucks anyway.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Goodnight I guess the pussy got your tongue.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Mr Ryan, you are just another republiturd minion.  You are not fit to be Speaker.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Balls don't think.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Trump is not racist - he has a low IQ.  He has difficulty understanding what his role as leader is and acts impulsively with no thought put into his actions.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Jerry D respect is earned. The idiot in chiefs actions is the reason that his popularity is at an all time low. Hurricane Harvey is about to hammer Texas and the damn fool is pardoning an 85 year old bigoted washed  up lawman.", "toxicity": 1, "sexual_explicit": 0}, {"text": "keep Trump in your own pussy, bubba", "toxicity": 1, "sexual_explicit": 1}, {"text": "Shameless self serving parasites.   No more, no less.", "toxicity": 1, "sexual_explicit": 0}, {"text": "I thought your three reasons were for what Trump brings to the table: Sex, lies and videotape.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Let go of your penis, man, you are embarrassing all of us. Except your friends, the other chronic one handed Typists", "toxicity": 1, "sexual_explicit": 1}, {"text": "Come and get me little one! waiting for company to come. all lefty tough guys; illegals welcome to come down too! You will leave here in the horizontal position. My german shepherds like to bite lefties\n\nTell everyone where I live, someone comes down here you little piece of shit, see you in court!", "toxicity": 1, "sexual_explicit": 0}, {"text": "Try again. The problem is racist right wingers and dog-whistle politics. Or you could claim the just plain stupid defense.", "toxicity": 1, "sexual_explicit": 0}, {"text": "You can stick your dick up anyone's butt. Why have any laws at all?", "toxicity": 1, "sexual_explicit": 1}, {"text": "5 comments out of 6 total, aka masturbation", "toxicity": 1, "sexual_explicit": 1}, {"text": "4 years is a long time .....for a state with lots of nude parks.....and pre teens that want sex from older men.....when ever I am close to a pre teen girl or boy ...they try and sex me up....sex laws are bull shit", "toxicity": 1, "sexual_explicit": 1}, {"text": "Eeekkk I hate to respond to this but historically Sodomy applied to forced anal sex.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Hard to believe that idiot and his union even attempted an appeal.  He was lucky that it wasn't more games.", "toxicity": 1, "sexual_explicit": 0}, {"text": "You have the disgraceful temerity to draw a moral equivalence between the Holocaust and the Jewish recovery miracle, and the Palestinian fourth generation, UN tit-sucking, Jew-hating refugee bullshit story. It's exceedingly charitable to describe you as a libtard.", "toxicity": 1, "sexual_explicit": 0}, {"text": "And yet a man who \"grabs her by the pussy\" is elected president..", "toxicity": 1, "sexual_explicit": 1}, {"text": "Obama threatens to slice off his dick, but somebody, we don't know who, complained...", "toxicity": 1, "sexual_explicit": 1}, {"text": "Looks like 90% of americans are utterly useless and deserve to die.  Seriously, never been camping without electronics? Ever? Never done survival for 2 weeks innawoods? It's not hard, I, for one, welcome a NK EMP, because while only 10% will live we will be 100% white.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Let's just cut to the chase ...\n\nThis \"nanny\" software is a paint-in-the-ass and accomplishes nothing useful.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Stop Making Stupid People Famous", "toxicity": 1, "sexual_explicit": 0}, {"text": "My thoughts exactly. I don't want his garbage comments coming to me at all times of the day and night.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Misconstrued my butt!", "toxicity": 1, "sexual_explicit": 1}, {"text": "If her pet peeves are stupidity, then good. It is a crime against children to continue to teach them this nonsense.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Because castration doesn't remove his ability to rape more women.  Castration is the removal of the testicles, not the penis.", "toxicity": 1, "sexual_explicit": 1}, {"text": "It was terrorism people. The administration does not want to look bad right before the election. Obama is more worried about his \"legacy\" then fighting a battle that has come to our shores. How many more attacks till he admits and says the words \"Islamist Extremists.\" They gave crap to Trump (sorry tRump wavemaker) for using the word \"bomb\". Hillery ( sorry hIllery ) acted just like Obama. Obama says if you don't vote for HRC you will tarnish his legacy. When do you admit we are at war? When it is over and we lost? Our leaders better get their heads out of their asses PDQ.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Yeah, sorry, but you're regurgitating bullshit. You want to be a pawn for the rich, fine, but why add to the misinformation?", "toxicity": 1, "sexual_explicit": 0}, {"text": "Yeah, rather than elect someone who, 15 years ago, in show biz and being egged on by billy said \"You can grab 'em by the pussy\".  Terrible, Disgusting, Bad.  We need to hire someone a little more civilized.  Like someone that gets a blow job from an intern in the Oral, I mean, Oval Office.", "toxicity": 1, "sexual_explicit": 1}, {"text": "maybe  if  you  kiss  my  ass  I'll put  a  good  word  in  for  you  at  the  welfare  office,  moocher.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Trudeau is treating Canadians like idiots. There will still be cash for access but it will be different somehow. These are the thoughts of a pot head . Would journalists please find out how much and when he is smoking weed.", "toxicity": 1, "sexual_explicit": 0}, {"text": "That photo shows there is no way his hand could have been under her skirt.  The photo doesn't rule out his hand was on her butt yet on the outside of her skirt.  The photo does show Taylor not being to terribly alarmed in any either case.", "toxicity": 1, "sexual_explicit": 1}, {"text": "I agree with Ms. McAnulty! I wonder what reaction there would be if a bunch of guys wore red cock and blue balls hats and marched around the city center. I expect it would be negative in the extreme no matter what they were protesting or supporting. There are certainly better ways to express dissatisfaction with President Trump than to stoop to vulgarity which is what I consider was done by those who marched with their pink genitalia hats.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Louie is living proof Michele obama had sex with a RAT", "toxicity": 1, "sexual_explicit": 1}, {"text": "Wow. People are so ignorant. I guess thats why they say ignorances is bliss.", "toxicity": 1, "sexual_explicit": 0}, {"text": "His or her butt....", "toxicity": 1, "sexual_explicit": 1}, {"text": "Trump's base are just dumb people who think he is what a smart person sounds like. No matter how hard you shake their trees, no fruit is going to fall onto the ground.", "toxicity": 1, "sexual_explicit": 0}, {"text": "I'm more than tired of taylor swift and her ass", "toxicity": 1, "sexual_explicit": 1}, {"text": "Looked at in the most positive light, anything Republicans propose can at most, be of only accidental, incidental benefit to anyone but the rich.  Anyone who believes differently is an idiot.", "toxicity": 1, "sexual_explicit": 0}, {"text": "I don't think the feds should jail these morons, but a whale going up a fresh water is pretty much dead", "toxicity": 1, "sexual_explicit": 0}, {"text": "You're lucky they didn't put a little hot sauce up your anus", "toxicity": 1, "sexual_explicit": 1}, {"text": "the governor is a pussy and a kiss ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Fire his ass", "toxicity": 1, "sexual_explicit": 1}, {"text": "The cause is the same thing that causes men to snore.  Their balls slowly hang down and cover their asshole and they become vaporlocked!", "toxicity": 1, "sexual_explicit": 1}, {"text": "I would have whipped around and told her that she was too stupid to teach.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Everything in that blog post is racist. It's a literal description of a racist's reaction to being in an area where they are the other. \n\nThe fact that you don't see anything racist in it tells me that you need to reexamine some things.\n\nAlso, ALL WHITE PEOPLE ARE RACIST. Having a knee jerk reaction and getting in your feelings when your racism is pointed out is less than helpful.", "toxicity": 1, "sexual_explicit": 0}, {"text": "well, we do have many anal sphincters!", "toxicity": 1, "sexual_explicit": 1}, {"text": "At least he didn't say something truly vile like \"I want to grab her pussy\". President Trump!!!!", "toxicity": 1, "sexual_explicit": 1}, {"text": "keepcalm\nFeb 9\nAnd yet a man who \"grabs her by the *****\" is elected president..\n\nis that the best you can come up with?", "toxicity": 1, "sexual_explicit": 1}, {"text": "It's you again with your nonsense. I know an eagle that will eat you up. Warbirds my ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "He also pulled his dick out a few times lol but really", "toxicity": 1, "sexual_explicit": 1}, {"text": "Murder, war and all kinds of violence is part of the White Man’s culture so I guess we should celebrate it.  Also stupidity SEE Donald Trump.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Thank goodness...it was a stupid idea from the get go.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Kissing ass and playing politics more important to him than the people he represents.  Sad choice.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Obviously more humane then this drunk,dog killing criminal.", "toxicity": 1, "sexual_explicit": 0}, {"text": "You gotta be kidding? Our government do something about it? Little Mr. Potato head and his public safety Minister Little fatty Buz cut will do dick.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Rueben, don't you mean \"no sé\" ?\n\nYou and The Donald went to the same debate prep class.\n\nDums culo class.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Why not have 2 pictures in the passport. One of your face and one of your genitals?", "toxicity": 1, "sexual_explicit": 1}, {"text": "yeah but butts is doing a horrible job - they are both very poor PM's.  Got to call a spade a spade.  We are better off with a blind monkey to refer to another post below - Butts is pathetic.  Time to kick Butts butt out and NOW.", "toxicity": 1, "sexual_explicit": 0}, {"text": "If I am a moron, then you are sewer trash, FYI.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Natives meet grass, Natives grow grass, taxman suck ass", "toxicity": 1, "sexual_explicit": 1}, {"text": "That's hilarious.  You object to the phrase Pussy Grabber?  But it's perfectly okay to say 'grab them by the pussy?'", "toxicity": 1, "sexual_explicit": 1}, {"text": "Hows your thumb doing in your butt?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Fox News Now Serving Up Undiluted Vigilante Porn", "toxicity": 1, "sexual_explicit": 1}, {"text": "Your just mad that thug beat your sissy broncos in Super Bowl XLVIII 43-8. No offense but I rather be a thug with big dick, millions of dollars with a superbowl ring vs your old fat ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "sex=exchange of body fluids. caring for a sick person with zika=body fluids.", "toxicity": 1, "sexual_explicit": 1}, {"text": "It is absolutely amazing how the MSM is trying to circumvent what is in the leaked emails by running with the Russian story.  The MSM thinks we are idiots. Fortunately, the liberal MSM is only a part of what we can read using the Internet.  The leaked emails show Hillary is a liar again.", "toxicity": 1, "sexual_explicit": 0}, {"text": "A Freudian slip indeed! After all, the penis mightier than the sword.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Pro-gun vs. Anti-gun. Anti-establishment vs. Establishment. Anti-Illegal Immigration vs. Pro-Illegal Immigration. Further (better) vetting of immigrants vs. Letting them in with the same system. Call out people that sexually assault/rape vs. Protect/cover up for sexual assaults/rape. Pretty distinct differences. Your vote. Your choice. Choose wisely.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Sure it's a stupid law in relation to a stupid religion.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Pull his pants down and sprinkle catnip on his pathetic dick while he is tied up. Let the cats scratch away for a few hours and see how that turns out.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Hows your Vagina hat coming along Roy \"boy toy\" Anthony", "toxicity": 1, "sexual_explicit": 1}, {"text": "It is ironic now though how the people who wanted him to step aside will be kissing his butt.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Gee i wish otapper was around so the korean boy king could boss him around and kick our ass. But ... barry otapper is gone time to drop a nuke", "toxicity": 1, "sexual_explicit": 1}, {"text": "We should not be pandering to this crap. Its simple if you have a penis you use the mens room if you have a vagina you use the womens restroom. End of story done.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Trump is an idiot.", "toxicity": 1, "sexual_explicit": 0}, {"text": "\"Racial profiling\"?\n\nYou mean like EPD arresting the two black guys who drove all the way from Southern California for kidnapping and robbery in the marijuana operation?\n\nOr arresting the black guy who just killed the female black cop sitting in the police van back East? \n\nThat kind of racial profiling?    It isn't my fault that black people commit more crimes proportionate to their numbers than white people. \n\nIf they drive a thousand miles to commit felonies and get caught, they are just stupid; color is irrelevant.\n\nAnd one of them still has his felony hold from California.\n\nYour beloved President Obama's District Director of the EPA was fired for her part in ignoring the Flint crisis, as you appear to want  to forget.\n\nShe didn't care about all those 'childrun'!  She was living high on the hog as an Obama appointee and couldn't be bothered to do the job she was being paid to do.", "toxicity": 1, "sexual_explicit": 0}, {"text": "What gender is a person who has a penis and breasts--naturally? You must wonder why men have nipples. Why also do men have two testes and women, two ovaries. Why is it that when women, who have vaginas (news flash for you), also have a penis, it is an oversized clitoris. Why are human fetuses sexually indistinguishable in the beginning?\n\n\"The normal human fetus of either sex has the potential to develop either male or female organs, depending on genetic and hormonal influences.\" And, according to Republicans, nothing could go wrong.\n\nhttps://www.britannica.com/science/sexual-differentiation", "toxicity": 1, "sexual_explicit": 1}, {"text": "Is wittle woy still hurt in his butt?", "toxicity": 1, "sexual_explicit": 1}, {"text": "Flip him around and kick him in the balls.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Fact: it would take less time , and building materials to build the border wall than to build a wall around Joy Behars vagina.", "toxicity": 1, "sexual_explicit": 1}, {"text": "61 years old and vandalizing private property, this feller needs a good cock punch and a strawberry yoohoo.", "toxicity": 1, "sexual_explicit": 1}, {"text": "They look stupid in their pussy hats, vulgar.  They are worse than the person they are hating on.", "toxicity": 1, "sexual_explicit": 1}, {"text": "He does grasp the pussy!", "toxicity": 1, "sexual_explicit": 1}, {"text": "Both sides are trying to provoke the other into taking the first shot to allow them political righteousness and insure their defense agreements. \n\nThis is a fight that has to happen. Kim is just too much nonsense to allow to live. No one will allow a mad dog to roam around their neighborhood unless they are stupid and weak.", "toxicity": 1, "sexual_explicit": 0}, {"text": "You forgot fake tits", "toxicity": 1, "sexual_explicit": 1}, {"text": "Uh, if he's \"having sex\" (trying to be civil here...) I think he's pretty clearly consented. With her, it is not so clear.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Screw Kap. I would rather go 6-10 than get that horse's ass...", "toxicity": 1, "sexual_explicit": 1}, {"text": "You're an IDIOT. An ignorant idiot speaking without a shred of a clue or information.  I'd advise you to do some reading but people like you don't read.", "toxicity": 1, "sexual_explicit": 0}, {"text": "Teach your lad his genitals are a  pox on humanity.", "toxicity": 1, "sexual_explicit": 1}, {"text": "One stupid criminal dead, three LEOs going home their families.\n\nDoesn't get much better than that.", "toxicity": 1, "sexual_explicit": 0}, {"text": "\"white fragility can kiss my ass. Your white tears aren't sacred, this land is.\" Masuma Khan. Ok Ms. Khan I get it. You're a racist exploiter struggling to make a place for yourself in the fascist pantheon.  It's tough being an original in that crowd, but at least you're blending in nicely.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Until kids are out of high school I don't think this should be going on.  I respect their personal beliefs but they need to respect that of mine to raise my children without exposure to these kind of confusing things at that age.  Once they are 18 go gang busters.  Until then keep your penis out of my daughter's lockerroom.", "toxicity": 1, "sexual_explicit": 1}, {"text": "If they can make so much more not working for the government, don't let the door hit you in the ass !", "toxicity": 1, "sexual_explicit": 1}, {"text": "Steaming pile of it. What they're going to end of up with is a core group of addicts who are untreatable and drug dealers who are richer than the guy who makes Yoga pants. Serious police work needs to be done, being lazy always ends up to bite you in the ass.", "toxicity": 1, "sexual_explicit": 1}, {"text": "If one of these a$$ clowns gets hit so hard he gets paralized then I will take a knee.............right after I finish laughing my a$$ off. It's called karma and these idiots deserve to get hurt so bad that their career ends so I don't have to watch this bull crap. I watch football for football.............not so these baboons can disrespect our country.", "toxicity": 1, "sexual_explicit": 0}, {"text": "For men, sex is a primal urge.  Do you think that all those adolescent boys telling young girls that they love them really love them?  Do you think that changes when a man is in his 20s or 30s?  Don't get me wrong, I love having sex with my wife and part of that is because I love her,  But having sex with her is not a matter of showing my love for her; it's me acting on my sexual drive.  Wanna know when sex and love for a man go together?  When he accepts without argument that his wife is not in the mood.", "toxicity": 1, "sexual_explicit": 1}, {"text": "Just when I thought I had heard everything, \"Throwing semen at women\". EXTREMELY ODD....Gotta be a  Mental Health Illness candidate. \n\nORS 163.415,  A person commits the crime of sexual abuse in the third degree if:\n\n(a) The person subjects another person to sexual contact and:\n\n(A) The victim does not consent to the sexual contact; or\n\n(B) The victim is incapable of consent by reason of being under 18 years of age; or\n\n(b) For the purpose of arousing or gratifying the sexual desire of the person or another person, the person intentionally propels any dangerous substance at a victim without the consent of the victim.\n\n(3) As used in this section, \"dangerous substance\" means blood, urine, semen or feces. \n\n10 years ago I knew a Lane County Deputy that went to work one day and when he went into his office he passed by his secretary, said Good Morning, and put his hand on HER shoulder as a friendly, warm gesture. She filed sexual abuse, she won, he was fired.  What about a hand shake?", "toxicity": 1, "sexual_explicit": 1}, {"text": "If I could grab women by the pussy  and keep my job or show my face in the coffee shop I'd have voted for Trump.", "toxicity": 1, "sexual_explicit": 1}]